import React, { useEffect, useRef } from 'react'
import { Helmet } from 'react-helmet'
import Typed from 'typed.js'
import bgvdo from '../videos/sea.mp4'
import '../scss/main.scss'

const Learning = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `กำหนดรู้ รู้ทันสิ่งที่มากระทบสัมผัส`,
        `ไม่เที่ยงเกิดดับ ตัวฉันเกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ตัวฉันคือรูป เวทนา สัญญา สังขาร วิญญาณ เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ รูป เวทนา สัญญา สังขาร วิญญาณ คือกาย เวทนา จิต ธรรม เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ กาย เวทนา จิต ธรรมคือโลกและชีวิต เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ผลต่อเนื่องของโลกและชีวิต คือวัตถุ สิ่งของ สัตว์ บุคคล เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ผลต่อเนื่องของวัตถุ สิ่งของ สัตว์ บุคคลคือรูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์ เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ผลต่อเนื่องของรูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์คือความพอใจ ไม่พอใจ เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ความพอใจ ไม่พอใจคือความไม่รู้ เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ความไม่รู้คืออวิชชา เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ผลต่อเนื่องของอวิชชา คือชีวิต เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ชีวิตคือตัวฉัน เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ตัวฉันคือรูป เวทนา สัญญา สังขาร วิญญาณ เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ รูป เวทนา สัญญา สังขาร วิญญาณ คือกาย เวทนา จิต ธรรม เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ กาย เวทนา จิต ธรรมคือโลกและชีวิต เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับโลกและชีวิตคือตัวฉัน เกิดขึ้น ตั้งอยู่ ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราว แล้วแตกสลาย ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ โลกและชีวิตเคลื่อนไหวเกิดขึ้น ตั้งอยู่ ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง ว่างเปล่าจากตนและของของตน`,
        `ไม่ควรไปยึดมั่นถือมั่นถือมั่นว่า โลกและชีวิตเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (1)`,
        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของตาเห็นรูปไม่เที่ยงเกิดดับ`,
        `ตาเห็นรูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของตาเห็นรูปไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของหูได้ยินเสียงไม่เที่ยงเกิดดับ`,
        `หูได้ยินเสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของหูได้ยินเสียงม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของจมูกได้กลิ่นไม่เที่ยงเกิดดับ`,
        `จมูกได้กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของจมูกได้กลิ่นไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของลิ้นได้รสไม่เที่ยงเกิดดับ`,
        `ลิ้นได้รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของลิ้นได้รสไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของกายสัมผัสไม่เที่ยงเกิดดับ`,
        `กายสัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของกายสัมผัสไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของใจคิดนึกไม่เที่ยงเกิดดับ`,
        `ใจคิดนึกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของใจคิดนึกไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของมโนกรรมไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของมโนกรรมไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของวจีกรรมไม่เที่ยงเกิดดับ`,
        `วจีกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของวจีกรรมไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เหตุปัจจัยของกายกรรมไม่เที่ยงเกิดดับ`,
        `กายกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ ผลต่อเนื่องของกายกรรมไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (2)`,
        `ไม่เที่ยงเกิดดับ ตาฉันเห็นรูปคือตัวฉันเห็นรูป ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ หูฉันได้ยินเสียงคือตัวฉันได้ยินเสียง ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ จมูกฉันได้กลิ่นคือตัวฉันได้กลิ่น ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ลิ้นฉันได้รสคือตัวฉันได้รส ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายฉันสัมผัสคือตัวฉันสัมผัส ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ใจฉันคิดนึกคือตัวฉันคิดนึก ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มโนกรรมฉันคิดคือตัวฉันคิด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ วจีกรรมฉันพูดคือตัวฉันพูด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายกรรมฉันทำคือตัวฉันทำ ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มือฉันจับไม้กวาดคือตัวฉันจับไม้กวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มือฉันกวาดคือตัวฉันกวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มือฉันเคลื่นไหวคือตัวฉันเคลื่อนไหว ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เท้าฉันเดินคือตัวฉันเดิน ทั้งหมดคือโลกและชีวิตผลต่อเนื่อง`,
        `เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (3)`,
        `ไม่เที่ยงเกิดดับ ตาฉันเห็นรูปคือตัวฉันเห็นรูป ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ หูฉันได้ยินเสียงคือตัวฉันได้ยินเสียง ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ จมูกฉันได้กลิ่นคือตัวฉันได้กลิ่น ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ลิ้นฉันได้รสคือตัวฉันได้รส ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายฉันสัมผัสคือตัวฉันสัมผัส ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ใจฉันคิดนึกคือตัวฉันคิดนึก ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มโนกรรมฉันคิดคือตัวฉันคิด ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ วจีกรรมฉันพูดคือตัวฉันพูด ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายกรรมฉันทำคือตัวฉันทำ ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มือฉันจับไม้กวาดคือตัวฉันจับไม้กวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มือฉันกวาดคือตัวฉันกวาด ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มือฉันเคลื่นไหวคือตัวฉันเคลื่อนไหว ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ เท้าฉันเดินคือตัวฉันเดิน ทั้งหมดคือโลกและชีวิตผลต่อเนื่องไม่ว่า`,
        `อดีต อนาคต และปัจจุบัน ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต`,
        `ไกลหรือใกล้ ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้น ตั้งอยู่ ดับไป ไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `บทวิปัสสนาภาวนา กำหนดรู้ (4)`,
        `ไม่เที่ยงเกิดดับ ตัวฉันผลต่อเนื่องของโลกและชีวิต เกิดขึ้นตั้งอยู่ดับไปไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ทุกสิ่งทุกอย่าง เป็นธรรมชาติและกฎธรรมชาติ 2 กฎไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ สิ่งทั้งปวงโลกและชีวิตผลต่อเนื่อง เกิดขึ้นตั้งอยู่ดับไปไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มโนกรรมความคิดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ วจีกรรมคำพูดไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายกรรมการเคลื่อนไหวไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (5)`,
        `ตัวอย่าง: เก้าอี้, โต๊ะ, พื้น`,

        `ไม่เที่ยงเกิดดับ เก้าอี้ เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ`,
        `โต๊ะ เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ`,
        `พื้น เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ เก้าอี้ โต๊ะ พื้น เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (6)`,
        `ตัวอย่าง: เก้าอี้`,

        `ไม่เที่ยงเกิดดับ ตัวฉันและเก้าอี้ เป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป `,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ทุกสิ่งทุกอย่างเป็นธรรมชาติชนิดหนึ่ง เกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (7)`,
        `ไม่เที่ยงเกิดดับ ตาเห็นรูปเป็นธรรมชาติชนิดหนึ่งเกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ หูได้ยินเสียงเป็นธรรมชาติชนิดหนึ่งเกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ ตาเห็นรูป จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ จมูกได้กลิ่นเป็นธรรมชาติชนิดหนึ่งเกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง ลิ้นได้รส กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ลิ้นได้รสเป็นธรรมชาติชนิดหนึ่งเกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น กายสัมผัส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายสัมผัสเป็นธรรมชาติชนิดหนึ่งเกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส ใจคิดนึก เป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ใจคิดนึกเป็นธรรมชาติชนิดหนึ่งเกิดขึ้นตั้งอยู่ดับไป`,
        `เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลายไม่เที่ยงเกิดดับ`,
        `กำหนดรู้ ตาเห็นรูป หูได้ยินเสียง จมูกได้กลิ่น ลิ้นได้รส กายสัมผัส เป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดขึ้นตั้งอยู่ดับไป เกิดจากเหตุปัจจัยมาประชุมชั่วคราวแล้วแตกสลาย ไม่เที่ยงเกิดดับเหมือนกัน`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (8)`,
        `ไม่เที่ยงเกิดดับ ตาเห็นรูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ หูได้ยินเสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ จมูกได้กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ลิ้นได้รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายสัมผัสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ ใจคิดนึกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ มโนกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (9)`,
        `ไม่เที่ยงเกิดดับ เกิดขึ้นตั้งอยู่ดับไปไม่เที่ยงเกิดดับ`,
        `มโนกรรมไม่เที่ยงเกิดดับ วจีกรรมไม่เที่ยงเกิดดับ กายกรรมไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (10)`,
        `(เอากฎธรรมชาติ 2 กฎไปลบชื่อ)`,
        `ตัวอย่าง: เก้าอี้`,
        `ไม่เที่ยงเกิดดับ เก้าอี้ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `ตัวอย่าง: แสงไฟ`,
        `ไม่เที่ยงเกิดดับ แสงไฟไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `ตัวอย่าง: ศาลา`,
        `ไม่เที่ยงเกิดดับ ศาลาไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
        `ตัวอย่าง: เสียงนก`,
        `ไม่เที่ยงเกิดดับ เสียงนกไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (11)`,
        `(เอาไปทำซ้ำ และฝึกกำหนดรู้)`,

        `ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,
        `ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,
        `ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,
        `ไม่เที่ยงเกิดดับ ชีวิตไม่เที่ยงเกิดดับ (กำหนดรู้ชีวิตคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,

        `ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,
        `ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,
        `ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,
        `ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ (กำหนดรู้ตัวฉันคือโลกและชีวิต ไม่เที่ยงเกิดดับ)`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (12)`,
        `ไม่เที่ยงเกิดดับ ตัวฉันเกิดขึ้นตั้งอยู่ดับไป ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ตัวฉันไม่มีตัวตนเป็นของตนเองไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ตัวฉันว่างเปล่าจากตนและของของตน ไม่เที่ยงเกิดดับ`,
        `ไม่เที่ยงเกิดดับ ไม่ควรไปยึดมั่นถือมั่นว่าตัวฉันเป็นของเราเป็นเราเป็นตัวตนของเราไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (13)`,
        `ตัวอย่าง: เดิน`,
        `ไม่เที่ยงเกิดดับ เดินเป็นธรรมชาติ เดินเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ`,

        `ตัวอย่าง: นั่ง`,
        `ไม่เที่ยงเกิดดับ นั่งเป็นธรรมชาติ นั่งเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ`,

        `ตัวอย่าง: ยืน`,
        `ไม่เที่ยงเกิดดับ ยืนเป็นธรรมชาติ ยืนเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ`,

        `ตัวอย่าง: นอน`,
        `ไม่เที่ยงเกิดดับ นอนเป็นธรรมชาติ นอนเสร็จเป็นกฎธรรมชาติ 2 กฎ ไม่เที่ยงเกิดดับ`,

        `ฝึกนำไปใช้ในชีวิตประจำวัน (14)`,
        `ไม่เที่ยงเกิดดับ ทุกข์คือความพอใจไม่พอใจ ความพอใจไม่พอใจคือทุกข์`,
        `ไม่เที่ยงเกิดดับคือสุข สุขคือไม่เที่ยงเกิดดับ`,

      ],
      typeSpeed: 50,
      loop: true,
    };

    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <Helmet>
        <title>I am Sirisak Chantanate</title>
        <meta itemprop="name" content="Sirisak Chantanate" />
        <meta name="Description"
              content="Nutrigenomics lover, I really love share the health knowledge." />

        <meta name="twitter:title" content="Sirisak Chantanate" />
        <meta name="twitter:description"
              content="Nutrigenomics lover, I really love share the health knowledge." />
        <meta property="og:title" />
        <meta property="og:url" content="https://openmymai.github.io/" />
        <meta property="og:description"
              content="Nutrigenomics lover, I really love share the health knowledge." />
      </Helmet>
      <div className="overflow-wrap">
        <section id="home" className="flex section--dark">
            <div className="bg-video">
                <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                    <source src={bgvdo} type="video/mp4" />
                </video>
            </div>
            <h1>
              <div className="text">
                <span style={{ whiteSpace: 'pre' }} ref={el} />
              </div>
            </h1>
        </section>
      </div>
    </>
  )
}

export default Learning
