import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain.mp4'
import '../scss/main.scss'


// markup
const Lesson0206 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `เท้าเดิน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าเท้าเดิน`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าโลกและชีวิต`,
        `มีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `เพราะเกิดจากเหตุปัจจัย`,
        `มาประชุมปรุงแต่งชั่วคราว`,
        `แล้วแตกสลาย`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `ความรู้สึกว่าสิ่งนี้มี`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
        
        `เหลียวซ้าย โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าเหลียวซ้าย`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าโลกและชีวิต`,
        `มีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `เพราะเกิดจากเหตุปัจจัย`,
        `มาประชุมปรุงแต่งชั่วคราว`,
        `แล้วแตกสลาย`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `ความรู้สึกว่าสิ่งนี้มี`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
        
        `เหลียวขวา โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าเหลียวขวา`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าโลกและชีวิต`,
        `มีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `เพราะเกิดจากเหตุปัจจัย`,
        `มาประชุมปรุงแต่งชั่วคราว`,
        `แล้วแตกสลาย`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `ความรู้สึกว่าสิ่งนี้มี`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
        
        `เงยหน้า โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าเงยหน้า`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าโลกและชีวิต`,
        `มีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `เพราะเกิดจากเหตุปัจจัย`,
        `มาประชุมปรุงแต่งชั่วคราว`,
        `แล้วแตกสลาย`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `ความรู้สึกว่าสิ่งนี้มี`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
        
        `ก้มหน้า โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าก้มหน้า`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าโลกและชีวิต`,
        `มีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `เพราะเกิดจากเหตุปัจจัย`,
        `มาประชุมปรุงแต่งชั่วคราว`,
        `แล้วแตกสลาย`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `ความรู้สึกว่าสิ่งนี้มี`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
        
        `การเคลื่อนไหว คือโลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าการเคลื่อนไหว`,
        `คือโลกและชีวิตมีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `เพราะเกิดจากเหตุปัจจัย`,
        `มาประชุมปรุงแต่งชั่วคราว`,
        `แล้วแตกสลาย`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
        
        `รูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์`,
        `คือโลกเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่า`,
        `รูป เสียง กลิ่น รส โผฏฐัพพะ ธรรมารมณ์`,
        `คือโลกมีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `ตา หู จมูก ลิ้่น กาย ใจ`,
        `คือชีวิตเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าตา หู จมูก ลิ้น กาย ใจ`,
        `คือชีวิตมีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `โลกและชีวิตกระทบสัมผัส`,
        `ผลต่อเนื่องที่เกิดขึ้นเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ความรู้สึกว่าโลกและชีวิตกระทบสัมผัส`,
        `ผลต่อเนื่องที่เกิดขึ้นมีตัวตนเป็นของตนเอง`,
        `เป็นความเห็นผิด`,
        `ความจริงเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        `กำหนดรู้สุขถาวรเกิดขึ้นแล้ว`,
        `เก็บสุขถาวรไว้ทันที`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ฝึกตามทันกายกรรม</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0207" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0206

export const Head = () => (
  <SEO title="Lesson0206" />
)