import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain.mp4'
import '../scss/main.scss'


// markup
const Lesson0512 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `อนาคตสูตรที่ 2`,
        `ว่าด้วยภัยในอนาคต 5 ประการ`,
        
        `ดูกรภิกษุทั้งหลาย`,
        `ภิกษุผู้เห็นภัย`,
        `ในอนาคต 5 ประการนี้`,
        `ก็ควรเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยว`,
        `เพื่อถึงธรรมที่ยังไม่ถึง`,
        `เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ`,
        `เพื่อทำให้แจ้งธรรม`,
        `ที่ยังไม่ได้ทำให้แจ้ง`,
        `ภัย 5 ประการเป็นไฉนคือ`,
        
        `ภิกษุในธรรมวินัยนี้`,
        `ย่อมพิจารณาเห็นดังนี้ว่า`,
        `บัดนี้เรายังเป็นหนุ่มแน่น`,
        `มีผมดำสนิท`,
        `ประกอบด้วยความเป็นหนุ่ม`,
        `อันเจริญตั้งอยู่ในปฐมวัย`,
        `ถึงกระนั้นก็มีสมัยที่ชรา`,
        `ย่อมจะถูกต้องกายนี้ได้`,
        `ก็ผู้ที่แก่แล้วถูกชราครอบงำแล้ว`,
        `จะมนสิการคำสั่งสอนของพระพุทธเจ้า`,
        `ไม่ใช่ทำได้ง่าย`,
        `จะเสพเสนาสนะอันสงัด`,
        `คือป่า และป่าชัฏก็ไม่ใช่ทำได้ง่าย`,
        `ก่อนที่ธรรมอันไม่น่าปรารถนา`,
        `ไม่น่าใคร่ไม่น่าพอใจนั้นจะมาถึงเรา`,
        `เราจะรีบปรารภความเพียร`,
        `เพื่อถึงธรรมที่ยังไม่ถึง`,
        `เพื่อทำให้แจ้งธรรม`,
        `ที่ยังไม่ได้ทำให้แจ้งเสียก่อนทีเดียว`,
        `ซึ่งเราประกอบแล้วแม้แก่ก็จักอยู่สบาย`,
        `ดูกรภิกษุทั้งหลาย`,
        `ภิกษุผู้เห็นภัยในอนาคตข้อที่ 1 นี้`,
        `ควรเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยวอยู่`,
        `เพื่อถึงธรรมที่ยังไม่ถึง`,
        `เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ`,
        `เพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง`,
        
        `อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า`,
        `บัตนี้เรามีอาพาธน้อยมีโรคเบาบาง`,
        `ประกอบด้วยไฟธาตุ`,
        `สำหรับย่อยอาหารสม่ำเสมอ`,
        `ไม่เย็นนะไม่ร้อนนักขนาดกลาง`,
        `ควรแก่การบำเพ็ญเพียร`,
        `แต่ย่อมมีสมัยที่พยาธิจะถูกต้องกายนี้`,
        `ก็ผู้ที่ป่วยไข้อันความป่วยไข้ครอบงำแล้ว`,
        `จะมนสิการคำสั่งสอนของพระพุทธเจ้า`,
        `ไม่ใช่ทำได้ง่าย`,
        `ซึ่งเราประกอบแล้วแม้ป่วยไข้`,
        `ก็จะอยู่สบาย`,
        `ภิกษุเห็นภัยในอนาคตข้อที่ 2 นี้`,
        `ควรเป็นผู้ไม่ประมาท`,
        
        `อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า`,
        `บัดนี้แลข้าวกล้าดีบิณฑบาตก็หาได้ง่าย`,
        `สะดวกแก่การแสวงหาเลี้ยงชีพ`,
        `แต่ก็ย่อมมีสมัยที่มีข้าวแพง`,
        `ข้าวกล้าไม่ดีบิณฑบาตหาได้ยาก`,
        `ไม่สะดวกแก่การแสวงหาเลี้ยงชีพ`,
        `อนึ่งในสมัยข้าวแพง`,
        `พวกมนุษย์ย่อมหลั่งไหลไปในที่ที่มีอาหารดี`,
        `ในที่นั้นย่อมมีการอยู่คลุกคลีด้วยหมู่คณะ`,
        `มีการอยู่พลุกพล่านกัน`,
        `เมื่อมีการอยู่คลุกคลีด้วยหมู่คณะ`,
        `อยู่พลุกพล่านกัน`,
        `จะมนสิการคำสั่งสอนของพระพุทธเจ้า`,
        `ไม่ใช่ทำได้ง่าย`,
        `ซึ่งเราประกอบแล้วก็จักอยู่สบาย`,
        `แม้ในเวลาทุพภิกขภัย`,
        `ภิกษุผู้เห็นภัยในอนาคตข้อที่ 3 นี้`,
        `ควรเป็นผู้ไม่ประมาท`,
        
        `อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า`,
        `บัดนี้แลมนุษย์ทั้งหลายย่อมเป็นผู้พร้อมเพรียงกัน`,
        `ชื่นชมต่อกันไม่วิวาทกัน`,
        `เป็นดังน้ำนมกับน้ำ `,
        `มองดูกันด้วยนัยน์ตาแสดงความรักอยู่`,
        `แต่ย่อมมีสมัยที่มีภัยมีความปั่นป่วน`,
        `ในดงประชาชนวุ่นวาย`,
        `และเมื่อมีภัยพวกมนุษย์ย่อมหลั่งไหล`,
        `ไปในที่ที่ปลอดภัย`,
        `ในที่นั้นย่อมมีการอยู่คลุกคลีด้วยหมู่คณะ`,
        `มีการอยู่พลุกพล่านกัน`,
        `เมื่อมีการอยู่คลุกคลีด้วยหมู่คณะ`,
        `อยู่พลุกพล่าน`,
        `จะมนสิการคำสั่งสอนของพระพุทธเจ้า`,
        `ไม่ใช่ทำได้ง่าย`,
        `ซึ่งเราประกอบแล้วก็จักอยู่สบาย`,
        `แม้ในสมัยที่มีภัย`,
        `ภิกษุผู้เห็นภัยในอนาคตข้อที่ 4 นี้`,
        `ควรเป็นผู้ไม่ประมาท`,
        
        `อีกประการหนึ่งภิกษุย่อมพิจารณาเห็นดังนี้ว่า`,
        `บัดนี้แลสงฆ์เป็นผู้พร้อมเพรียงกัน`,
        `ชื่นชมต่อกันไม่วิวาทกัน`,
        `มีอุเทศร่วมกันอยู่ผาสุข`,
        `แต่ก็ย่อมมีสมัยที่สงฆ์แตกกัน`,
        `ก็เมื่อสงฆ์แตกกันแล้ว`,
        `จะมมสิการคำสั่งสอนของพระพุทธเจ้า`,
        `ไม่ใช่ทำได้ง่าย`,
        `จะเสพเสนาสนะอันสงัดคือป่า`,
        `และป่าชัฏก็ไม่ใช่ทำได้ง่าย`,
        `ก่อนที่ธรรมอันไม่น่าปรารถนา`,
        `ไม่น่าใคร่ไม่น่าพอใจนั้นจะมาถึงเรา`,
        `เราจะรีบปรารภความเพียร`,
        `เพื่อถึงธรรมที่ยังไม่ถึง`,
        `เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ`,
        `เพื่อทำให้แจ้งธรรมที่ยังไม่ได้ทำให้แจ้ง`,
        `ซึ่งเราประกอบแล้วก็จะอยู่สบาย`,
        `แม้ในเมื่อสงฆ์แตกกัน`,
        `ดูกรภิกษุทั้งหลาย`,
        `ภิกษุผู้เห็นภัยในอนาคตข้อที่ 5 นี้แล`,
        `ควรเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยว`,
        `อยู่เพื่อถึงธรรมที่ยังไม่ถึง`,
        `เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ`,
        `เพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง`,
        `ดูกรภิกษุทั้งหลาย`,
        `ภิกษุผู้เห็นภัยในอนาคต 5 ประการนี้`,
        `ควรเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยว`,
        `อยู่เพื่อถึงธรรมที่ยังไม่ถึง`,
        `เพื่อบรรลุธรรมที่ยังไม่ได้บรรลุ`,
        `เพื่อทำให้แจ้งทำที่ยังไม่ได้ทำให้แจ้ง`,     
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">อนาคตสูตรที่ 2</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0512

export const Head = () => (
  <SEO title="Lesson0512" />
)