import React, { useEffect, useRef } from 'react'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain.mp4'
import '../scss/main.scss'


// markup
const Lesson = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
          `ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `กายสัมผัส ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `ใจคิดนึก ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `ตาเห็นรูป รูปไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `รูปเป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา`,
          `ไม่มีตัวตนเป็นของตนเอง`,
          `ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `เสียงเป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา`,
          `ไม่มีตัวตนเป็นของตนเอง`,
          `ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `กลิ่นเป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา`,
          `ไม่มีตัวตนเป็นของตนเอง`,
          `ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `ลิ้นได้รส รสไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `รสเป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา`,
          `ไม่มีตัวตนเป็นของตนเอง`,
          `ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กายสัมผัส ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `สัมผัสเป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา`,
          `ไม่มีตัวตนเป็นของตนเอง`,
          `ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `ใจคิดนึก ไม่เที่ยงเกิดดับ ตัวฉันไม่เที่ยงเกิดดับ`,
          `ความคิดเป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่เที่ยง เป็นทุกข์ เป็นอนัตตา`,
          `ไม่มีตัวตนเป็นของตนเอง`,
          `ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `รูป ร่างกาย อย่างใดอย่างหนึ่งที่เป็นอดีต อนาคต และปัจจุบัน`,
          `ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้`,
          `ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`,
          `เวทนา ความพอใจไม่พอใจ อย่างใดอย่างหนึ่งที่เป็นอดีต อนาคต และปัจจุบัน`,
          `ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้`,
          `ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`,
          `สัญญา ความจำ อย่างใดอย่างหนึ่งที่เป็นอดีต อนาคต และปัจจุบัน`,
          `ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้`,
          `ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`,
          `สังขาร ความคิด อย่างใดอย่างหนึ่งที่เป็นอดีต อนาคต และปัจจุบัน`,
          `ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้`,
          `ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`,
          `วิญญาณ ความรู้ อย่างใดอย่างหนึ่งที่เป็นอดีต อนาคต และปัจจุบัน`,
          `ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้`,
          `ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`,
          `อุปทานขันธ์ 5 เป็นธรรมชาติชนิดหนึ่ง`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`,
          `รูป ร่างกาย อย่างใดอย่างหนึ่งที่เป็นอดีต อนาคต และปัจจุบัน`,
          `ภายในหรือภายนอก หยาบหรือละเอียด เลวหรือประณีต ไกลหรือใกล้`,
          `ทั้งหมดเป็นธรรมชาติชนิดหนึ่ง เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว กำลังจะแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
          `ไม่เที่ยงเกิดดับ`
        ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">      
              <h1><div className="text">วิปัสสนาภาวนา พิจารณาขันธ์ 5 อินทรีย์ 6</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson