import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain04.mp4'
import '../scss/main.scss'


// markup
const Lesson0504 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ภาวนาเสมอด้วยธาตุ 5`,
        `ดูกรราหุล`,
        `เธอจงเจริญภาวนา`,
        `เสมอด้วยแผ่นดินเถิด`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยแผ่นดินอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        `ดูกรราหุล`,
        `เปรียบเหมือนคนทั้งหลาย`,
        `ทิ้งของสะอาดบ้างไม่สะอาดบ้าง`,
        `คูถบ้าง มูตรบ้าง`,
        `น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง`,
        `ลงที่แผ่นดิน แผ่นดินจะอึดอัด`,
        `หรือระอาหรือเกลียดของนั้นก็หาไม่ฉันใด`,
        `เธอจงเจริญภาวนา`,
        `เสมอด้วยแผ่นดินฉันนั้นแล`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยแผ่นดินอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        
        `ดูกรราหุล`,
        `เธอจงเจริญภาวนาเสมอด้วยน้ำเถิด`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยน้ำอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        `ดูกรราหุล`,
        `เปรียบเหมือนคนทั้งหลาย`,
        `ล้างของสะอาดบ้างของไม่สะอาดบ้าง`,
        `คูถบ้าง มูตรบ้าน`,
        `น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง`,
        `ลงในน้ำ น้ำจะอึดอัดหรือระอา`,
        `หรือเกลียดของนั้นก็หาไม่ฉันใด`,
        `เธอจงเจริญภาวนา`,
        `เสมอด้วยน้ำฉันนั้นแล`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยน้ำอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,

        `ดูกรราหุล`,
        `เธอจงเจริญภาวนาเสมอด้วยไฟเถิด`,
        `เพราะเมื่อเธอเจริญภาวนาเสมอด้วยไฟอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจะไม่ครอบงำจิตได้`,
        `ลูกรราหุล`,
        `เปรียบเหมือนไฟ`,
        `ที่เผาของสะอาดบ้านของไม่สะอาดบ้าง`,
        `คูถบ้าง มูตรบ้าง`,
        `น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง`,
        `ไฟจะอึดอัดหรือระอา`,
        `หรือเกลียดของนั้นก็หาไม่ฉันใด`,
        `เธอจงเจริญภาวนา`,
        `เสมอด้วยไฟฉันนั้นแล`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยไฟอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        
        `ดูกรราหุล`,
        `เธอจงเจริญภาวนาเสมอด้วยลมเถิด`,
        `เพราะเมื่อเธอเจริญภาวนาเสมอด้วยลมอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตของเธอได้`,
        `ดูกรราหุล`,
        `เปรียบเหมือนลมย่อมพัดต้อง`,
        `ของสะอาดบ้างของไม่สะอาดบ้าง`,
        `คูถบ้าง มูตรบ้าง`,
        `น้ำลายบ้าง น้ำหนองบ้าง เลือดบ้าง`,
        `ลมจะอึดอัดหรือระอา`,
        `หรือเกลียดของนั้นก็หาไม่ฉันใด`,
        `เธอจงเจริญภาวนา`,
        `เสมอด้วยลมฉันนั้น`,
        `ก็เมื่อเธอเจริญภาวนา`,
        `เสมอด้วยลมอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        
        `ดูกรราหุล`,
        `เธอจงเจริญภาวนาเสมอด้วยอากาศเถิด`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยอากาศอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        `ดูกรราหุล`,
        `เปรียบเหมือนอากาศ`,
        `ไม่ตั้งอยู่ในที่ไหนฉันใด`,
        `เธอจงเจริญภาวนา`,
        `เสมอด้วยอากาศฉันนั้นแล`,
        `เพราะเมื่อเธอเจริญภาวนา`,
        `เสมอด้วยอากาศอยู่`,
        `ผัสสะอันเป็นที่ชอบใจและไม่ชอบใจ`,
        `ที่เกิดขึ้นแล้วจักไม่ครอบงำจิตได้`,
        
        `การเจริญภาวนาธรรม 6 อย่าง`,
        `ดูกรราหุล`,
        `เธอจงเจริญเมตตาภาวนาเถิด`,
        `เพราะเมื่อเธอเจริญเมตตาภาวนาอยู่`,
        `จักละพยาบาทได้`,
        `เธอจงเจริญกรุณาภาวนาเถิด`,
        `เพราะเมื่อเธอเจริญกรุณาภาวนาอยู่`,
        `จักละวิหิงสาได้`,
        `เธอจงเจริญมุทิตาภาวนาเถิด`,
        `เพราะเมื่อเธอเจริญมุทิตาภาวนาอยู่`,
        `จักละอรติได้`,
        `เธอจงเจริญอุเบกขาภาวนาเถิด`,
        `ก็เมื่อเธอเจริญอุเบกขาภาวนาอยู่`,
        `จักละปฏิฆะได้`,
        `เธอจงเจริญอสุภภาวนาเถิด`,
        `เพราะเมื่อเธอเจริญอสุภภาวนาอยู่`,
        `จักละราคาได้`,
        `เธอจงเจริญอนิจจสัญญาภาวนาเถิด`,
        `เพราะเมื่อเธอเจริญอนิจจสัญญาภาวนาอยู่`,
        `จักละอัสมิมานะได้`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ภิกขุวรรค จูฬราหุโลวาทสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0505" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0504

export const Head = () => (
  <SEO title="Lesson0504" />
)