import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain.mp4'
import '../scss/main.scss'


// markup
const Lesson0606 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `พระนครสาวัตถี`,
        `ครั้งนั้นแล`,
        `ภิกษุรูปหนึ่ง`,
        `เข้าไปเฝ้าพระผู้มีพระภาค`,
        `ถึงที่ประทับ ฯลฯ`,
        `ครั้นแล้ว`,
        `ได้ทูลถามพระผู้มีพระภาคว่า`,
        `ข้าแต่พระองค์ผู้เจริญ`,
        `ที่เรียกว่า อวิชชา`,
        `อวิชชา ดังนี้`,
        `อวิชชาเป็นไฉนหนอแล`,
        `และบุคคลเป็นผู้ประกอบ`,
        `ด้วยอวิชชาด้วยเหตุเพียงเท่าไร?`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `ดูกรภิกษุ`,
        `ปุถุชนผู้ไม่ได้สดับแล้วในโลกนี้`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งรูปอันมีความเกิดขึ้น`,
        `เป็นธรรมดาว่า`,
        `รูปมีความเกิดขึ้นเป็นธรรมดา`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งรูปอันมีความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `รูปมีความเสื่อมไปเป็นธรรมดา`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งรูปอันมีความเกิดขึ้น`,
        `และความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `รูปมีความเกิดขึ้น`,
        `และความเสื่อมไปเป็นธรรมดา`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งเวทนา`,
        `ย่อมไม่รู้ชัดตาม`,
        `ความเป็นจริง`,
        `ซึ่งสัญญา`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งสังขาร`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งวิญญาณ`,
        `อันมีความเกิดขึ้น`,
        `เป็นธรรมดาว่า`,
        `วิญญาณมีความเกิดขึ้น`,
        `เป็นธรรมดา`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งวิญญาณ`,
        `อันมีความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `วิญญาณมีความเสื่อมไป`,
        `เป็นธรรมดา`,
        `ย่อมไม่รู้ชัด`,
        `ตามความเป็นจริง`,
        `ซึ่งวิญญาณ`,
        `อันมีความเกิดขึ้น`,
        `และความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `วิญญาณมีความเกิดขึ้น`,
        `และความเสื่อมไป`,
        `เป็นธรรมดา`,
        `ดูกรภิกษุ นี้เรียกว่า`,
        `อวิชชา และบุคคล`,
        `เป็นผู้ประกอบด้วยอวิชชา`,
        `ด้วยเหตุเพียงเท่านี้`,
        `เมื่อพระผู้มีพระภาค`,
        `ตรัสอย่างนี้แล้ว`,
        `ภิกษุนั้นทูลถามว่า`,
        `ข้าแต่พระองค์ผู้เจริญ`,
        `ที่เรียกว่า วิชชา`,
        `วิชชา ดังนี้`,
        `วิชชาเป็นไฉนหนอแล`,
        `และบุคคล`,
        `เป็นผู้ประกอบด้วยวิชชา`,
        `ด้วยเหตุเพียงเท่าไร?`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `ดูกรภิกษุ`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `ในธรรมวินัยนี้`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งรูป อันมีความเกิดขึ้น`,
        `เป็นธรรมดาว่า`,
        `รูปมีความเกิดขึ้น`,
        `เป็นธรรมดา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งรูป อันมีความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `รูปมีความเสื่อมไป`,
        `เป็นธรรมดา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งรูป อันมีความเกิดขึ้น`,
        `และความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `รูปมีความเกิดขึ้น`,
        `และความเสื่อมไป`,
        `เป็นธรรมดา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งเวทนา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งสัญญา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งสังขาร`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งวิญญาณ`,
        `อันมีความเกิดขึ้น`,
        `เป็นธรรมดาว่า`,
        `วิญญาณมีความเกิดขึ้น`,
        `เป็นธรรมดา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งวิญญาณ`,
        `อันมีความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `วิญญาณมีความเสื่อมไป`,
        `เป็นธรรมดา`,
        `ย่อมรู้ชัดตามความเป็นจริง`,
        `ซึ่งวิญญาณ`,
        `อันมีความเกิดขึ้น`,
        `และความเสื่อมไป`,
        `เป็นธรรมดาว่า`,
        `วิญญาณมีความ`,
        `เกิดขึ้นและเสื่อมไป`,
        `เป็นธรรมดา`,
        `ดูกรภิกษุ นี้เรียกว่า วิชชา`,
        `และบุคคลเป็นผู้ประกอบด้วยวิชชา`,
        `ด้วยเหตุเพียงเท่านี้แล`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">สมุทยธัมมสูตรที่ ๑</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0606

export const Head = () => (
  <SEO title="Lesson0606" />
)