import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain04.mp4'
import '../scss/main.scss'


// markup
const Lesson0511 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `สัมมสนสูตรที่ 2`,
        `ว่าด้วยปัจจัยให้ชราและมรณะ`,
        
        `สมัยหนึ่งท่านพระสารีบุตร`,
        `และท่านพระมหาโกฏฐิตะ`,
        `อยู่ ณ ป่าอิสิปตนมฤคทายวัน`,
        `เขตพระนครพาราณสี`,
        `ครั้งนั้นแลเป็นเวลาเย็น`,
        `ท่านพระมหาโกฏฐิตะ`,
        `ออกจากที่พักผ่อน`,
        `เข้าไปหาพระสารีบุตรถึงที่อยู่`,
        `ได้ปราศรัยกับท่านพระสารีบุตร`,
        `ครั้นผ่านการปราศรัย`,
        `พอให้ระลึกถึงกันไปแล้ว`,
        `จึงนั่งณที่ควรส่วนข้างหนึ่ง`,
        `ท่านพระมหาโกฏฐิตะ`,
        `นั่งเรียบร้อยแล้ว`,
        `ได้กล่าวคำนี้กะท่านพระสารีบุตรว่า`,
        `ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า`,
        `ชราและมรณะตนทำเอง`,
        `ผู้อื่นทำให้ `,
        `ทั้งตนทำเองทั้งผู้อื่นทำให้`,
        `หรือว่าชราและมรณะบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้`,
        `ท่านพระสารีบุตรกล่าวตอบว่า`,
        `ท่านโกลิตะชราและมรณะ`,
        `ตนทำเองก็ไม่ใช่`,
        `ผู้อื่นทำให้ก็ไม่ใช่`,
        `ทั้งต้นทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่`,
        `บังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่`,
        `แต่ว่าเพราะชาติเป็นปัจจัย`,
        `จึงมีชราและมรณะ`,
        `ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า`,
        `ท่านสารีบุตรชาติตนทำเอง`,
        `ผู้อื่นทำให้`,
        `ทั้งต้นทำเองทั้งผู้อื่นทำให้`,
        `หรือว่าชาติบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้`,
        `ท่านพระสารีบุตรกล่าวตอบว่า`,
        `ท่านโกลิตะชาติตนทำเองก็ไม่ใช่`,
        `ผู้อื่นทำให้ก็ไม่ใช่`,
        `ทั้งตนทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่`,
        `ชาติบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่`,
        `แต่เพราะภพเป็นปัจจัยจึงมีชาติ`,
        `ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า`,
        `ท่านสารีบุตรภพตนทำเอง`,
        `อุปทานตนทำเอง`,
        `ตัณหาตนทำเอง`,
        `เวทนาตนทำเอง`,
        `ผัสสะตนทำเองทำเอง`,
        `นามรูปตนทำเอง`,
        `ผู้อื่นทำให้`,
        `ทั้งตนทำเองทั้งผู้อื่นทำให้`,
        `หรือว่านามรูปบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้`,
        `ท่านพระสารีบุตรกล่าวตอบว่าท่านโกฏฐิตะ`,
        `นามรูปตนทำเองก็ไม่ใช่`,
        `ผู้อื่นทำให้ก็ไม่ใช่`,
        `ทั้งต้นทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่`,
        `นามรูปบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่`,
        `แต่เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป`,
        `ท่านพระมหาโกฏฐิตะถามพระสารีบุตรว่า`,
        `ท่านสารีบุตรวิญญาณตนทำเอง`,
        `ผู้อื่นทำให้`,
        `ทั้งตนทำเอง`,
        `ทั้งผู้อื่นทำให้`,
        `หรือว่าวิญญาณบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้`,
        `ท่านพระสารีบุตรกล่าวตอบว่าท่านโกฏฐิตะ`,
        `วิญญาณตนทำเองก็ไม่ใช่`,
        `ผู้อื่นทำให้ก็ไม่ใช่`,
        `ทั้งตนเองและผู้อื่นทำให้ก็ไม่ใช่`,
        `วิญญาณบังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่`,
        `แต่เพราะนามรูปเป็นปัจจัยจึงมีวิญญาณ`,
        `เราทั้งหลายเพิ่งรู้ชัดภาษิต`,
        `ของท่านสารีบุตรในบัดนี้เอง`,
        `อย่างนี้ว่าท่านโกฏฐิตะ`,
        `นามรูปตนทำเองก็ไม่ใช่`,
        `ผู้อื่นทำให้ก็ไม่ใช่`,
        `ทั้งตนทำเองทั้งผู้อื่นทำให้ก็ไม่ใช่`,
        `บังเกิดขึ้น`,
        `เพราะอาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่`,
        `แต่เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป`,
        `อนึ่งเราทั้งหลายรู้ชัดภาษิต`,
        `ของท่านพระสารีบุตรในบัดนี้เอง`,
        `อย่างนี้ว่าท่านโกฏฐิตะ`,
        `วิญญาณตนทำเองก็ไม่ใช่`,
        `ผู้อื่นก็ทำให้ก็ไม่ใช่`,
        `บังเกิดขึ้นเพราะ`,
        `อาศัยตนไม่ได้ทำเอง`,
        `ผู้อื่นไม่ได้ทำให้ก็ไม่ใช่`,
        `แต่เพราะนามรูปเป็นปัจจัย`,
        `จึงมีวิญญาณ`,
        
        `ท่านสารีบุตรก็เนื้อความของภาษิตนี้`,
        `เราทั้งหลายจะพึงเห็นได้อย่างไร`,
        `ดูกรอาวุโสถ้าเช่นนั้น`,
        `ผมจะเปรียบให้ท่านฟัง`,
        `ในโลกนี้บุรุษผู้ฉลาดบางพวก`,
        `ย่อมรู้ชัดเนื้อความของภาษิต`,
        `ได้แม้ด้วยอุปมา`,
        `อาวุโสไม้อ้อ 2 กำพึงตั้งอยู่ได้`,
        `เพราะต่างอาศัยซึ่งกันและกันฉันใด`,
        `เพราะนามรูปเป็นปัจจัยจึงมีวิญญาณ`,
        `เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป`,
        `ท่อนามรูปเป็นปัจจัยจึงมีสฬายตนะ`,
        `สฬายตนะเป็นปัจจัยจึงมีผัสสะ`,
        `ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้ฉันนั้นแล`,
        
        `ถ้าไม้อ้อ 2 กำนั้นพึงเอาออกเสียกำหนึ่ง`,
        `อีกคำหนึ่งก็ล้มไป`,
        `ถ้าดึงอีกกำหนึ่งออก`,
        `อีกคำหนึ่งก็ล้มไปฉันใด`,
        `เพราะนามรูปดับวิญญาณจึงดับ`,
        `เพราะวิญญาณดับนามรูปจึงดับ`,
        `เพราะนามรูปดับสฬายตนะจึงดับ`,
        `เพราะสฬายตนะดับผัสสะจึงดับ`,
        `ความดับแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้ฉันนั้นแล`,
        
        `น่าอัศจรรย์ท่านสารีบุตรไม่เคยมีมา`,
        `ท่านสารีบุตรเท่าที่ท่านสารีบุตรกล่าวนี้`,
        `เป็นอันกล่าวดีแล้ว`,
        `ก็แลเราทั้งหลายพลอยยินดีสุภาษิตนี้`,
        `ของท่านสารีบุตร`,
        `ด้วยเรื่อง 36 เรื่องเหล่านี้`,
        
        `ถ้าภิกษุแสดงธรรมเพื่อความหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับชราและมรณะ`,
        `ควรจะกล่าวว่าภิกษุธรรมกถึก`,
        
        `ถ้าภิกษุปฏิบัติเพื่อความหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับชราและมรณะ`,
        `ควรจะกล่าวว่า`,
        `ภิกษุปฏิบัติธรรมสมควรแก่ธรรม`,
        
        `ถ้าภิกษุหลุดพ้นเพราะความหน่าย`,
        `เพราะคลายกำหนัด`,
        `เพราะความดับ`,
        `เพราะไม่ถือมั่นชราและมรณะ`,
        `ควรจะกล่าวว่า`,
        `ภิกษุบรรลุนิพพานในปัจจุบัน`,
        
        `ถ้าภิกษุแสดงธรรมเพื่อความหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับชาติ ภพ อุปาทาน`,
        `ตัณหา เวทนา ผัสสะ `,
        `สฬายตนะ นามรูป`,
        `วิญญาณ สังขารทั้งหลาย อวิชชา`,
        `ควรจะกลับว่าภิกษุธรรมกถึก`,
        `ถ้าภิกษุปฏิบัติเพื่อความหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับอวิชชา`,
        `ควรจะกล่าวว่า`,
        `ภิกษุปฏิบัติธรรมสมควรแก่ธรรม`,
        
        `ถ้าภิกษุหลุดพ้น เพราะความหน่าย`,
        `เพราะคลายกำหนัด`,
        `เพราะความดับ`,
        `เพราะความไม่ถือมั่นในอวิชชา`,
        `ควรจะกล่าวว่าภิกษุบรรลุนิพพานในปัจจุบัน`,        
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">สัมมสนสูตรที่ 2</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0512" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0511

export const Head = () => (
  <SEO title="Lesson0511" />
)