import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain03.mp4'
import '../scss/main.scss'


// markup
const Lesson0402 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `อดีต อนาคต ปัจจุบัน อนิจจสูตร`,
        `ว่าด้วยความเป็นอนิจจัง`,
        `แห่งอายตนะภายในทั้งสามกาล`,
        `ดูกรภิกษุทั้งหลาย`,
        `จักษุที่เป็นอดีตและอนาคต`,
        `เป็นของไม่เที่ยง`,
        `จะกล่าวไปใยถึงจักษุ`,
        `ที่เป็นปัจจุบันเล่า`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `เห็นอยู่อย่างนี้`,
        `ย่อมไม่มีเยื่อใย`,
        `ในจักษุที่เป็นอดีต`,
        `ไม่เพลิดเพลินจักษุ`,
        `ที่เป็นอนาคต`,
        `ย่อมปฏิบัติเพื่อเบื่อหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับจักษุที่เป็นปัจจุบัน`,
        `หู จมูก ลิ้น กาย ใจ`,
        `ที่เป็นอดีตและอนาคต`,
        `เป็นของไม่เที่ยง`,
        `จะกล่าวไปใย`,
        `ถึงใจที่เป็นปัจจุบันเล่า`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `เห็นอยู่อย่างนี้`,
        `ย่อมไม่มีเยื่อใยในใจ`,
        `ที่เป็นอดีต`,
        `ไม่เพลิดเพลินในใจ`,
        `ที่เป็นอนาคต`,
        `ย่อมปฏิบัติเพื่อเบื่อหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับซึ่งใจที่เป็นปัจจุบัน`,

        `อดีต อนาคต ปัจจุบัน ทุกข์สูตร`,
        `ว่าด้วยความเป็นทุกข์`,
        `แห่งอายตนะภายในทั้งสามกาล`,
        `ดูกรภิกษุทั้งหลาย`,
        `จักษุที่เป็นอดีตและอนาคต`,
        `เป็นทุกข์`,
        `จะกล่าวไปใย`,
        `ถึงจักษุที่เป็นปัจจุบันเล่า`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `เห็นอยู่อย่างนี้`,
        `ย่อมไม่มีเยื่อใย`,
        `ในจักษุที่เป็นอดีต`,
        `ไม่เพลิดเพลินจักษุ`,
        `ที่เป็นอนาคต`,
        `ย่อมปฏิบัติเพื่อเบื่อหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับจักษุที่เป็นปัจจุบัน`,
        `หู จมูก ลิ้น กาย ใจ`,
        `ที่เป็นอดีตและอนาคต`,
        `เป็นทุกข์`,
        `จะกล่าวไปใยถึงใจ`,
        `ที่เป็นปัจจุบันเล่า`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `เห็นอยู่อย่างนี้`,
        `ย่อมไม่มีเยื่อใยในใจ`,
        `ที่เป็นอดีต`,
        `ไม่เพลิดเพลินในใจ`,
        `ที่เป็นอนาคต`,
        `ย่อมปฏิบัติเพื่อเบื่อหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับซึ่งใจที่เป็นปัจจุบัน`,

        `อดีต อนาคต ปัจจุบัน อนัตตาสูตร`,
        `ว่าด้วยความเป็นอนัตตา`,
        `แห่งอายตนะภายใน`,
        `ทั้งสามกาล`,
        `ดูกรภิกษุทั้งหลาย`,
        `จักษุที่เป็นอดีตและอนาคต`,
        `เป็นอนัตตา`,
        `จะกล่าวไปใย`,
        `ถึงจักษุที่เป็นปัจจุบันเล่า`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `เห็นอยู่อย่างนี้`,
        `ย่อมไม่มีเยื่อใย`,
        `ในจักษุที่เป็นอดีต`,
        `ไม่เพลิดเพลินจักษุ`,
        `ที่เป็นอนาคต`,
        `ย่อมปฏิบัติเพื่อเบื่อหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับจักษุที่เป็นปัจจุบัน`,
        `หู จมูก ลิ้น กาย ใจ`,
        `ที่เป็นอดีตและอนาคต`,
        `เป็นอนัตตา`,
        `จะกล่าวไปใยถึงใจ`,
        `ที่เป็นปัจจุบันเล่า`,
        `อริยสาวกผู้ได้สดับแล้ว`,
        `เห็นอยู่อย่างนี้`,
        `ย่อมไม่มีเยื่อใยในใจ`,
        `ที่เป็นอดีต`,
        `ไม่เพลิดเพลินในใจ`,
        `ที่เป็นอนาคต`,
        `ย่อมปฏิบัติเพื่อเบื่อหน่าย`,
        `เพื่อคลายกำหนัด`,
        `เพื่อดับซึ่งใจที่เป็นปัจจุบัน`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">อดีต อนาคต ปัจจุบัน อนิจจสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0403" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0402

export const Head = () => (
  <SEO title="Lesson0402" />
)