import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0309 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ถ้ามีคนพึงถามอย่างนี้ว่า`,
        `ธรรมทั้งปวงมีอะไรเป็นมูล`,
        `ธรรมทั้งปวงมีอะไรเป็นแดนเกิด`,
        `ธรรมทั้งปวงมีอะไรเป็นสมุทัย`,
        `ธรรมทั้งปวงมีอะไรเป็นที่ประชุมลง`,
        `ธรรมทั้งปวงมีอะไรเป็นประมุข`,
        `ธรรมทั้งปวงมีอะไรเป็นใหญ่`,
        `ธรรมทั้งปวงมีอะไรเป็นยิ่งกว่า`,
        `ธรรมทั้งปวงมีอะไรเป็นแก่นสาร`,
        `ให้ตอบอย่างนี้ว่า`,
        `ธรรมทั้งปวงมีอะไรเป็นมูล`,
        `มีฉันทะเป็นมูล`,
        `ธรรมทั้งปวงมีอะไรเป็นแดนเกิด`,
        `มีมนสิการเป็นแดนเกิด`,
        `ธรรมทั้งปวงมีอะไรเป็นสมุทัย`,
        `มีผัสสะเป็นสมุทัย`,
        `ธรรมทั้งปวงมีอะไรเป็นที่ประชุมลง`,
        `มีเวทนาเป็นที่ประชุมลง`,
        `ธรรมทั้งปวงมีอะไรเป็นประมุข`,
        `มีสมาธิเป็นประมุข`,
        `ธรรมทั้งปวงมีอะไรเป็นใหญ่`,
        `มีสติเป็นใหญ่`,
        `ธรรมทั้งปวงมีอะไรเป็นยิ่งกว่า`,
        `มีปัญญาเป็นยิ่ง`,
        `ธรรมทั้งปวงมีอะไรเป็นแก่นสาร	`,
        `มีวิมุติเป็นแก่นสาร`,
        `พระพุทธเจ้าตรัสไว้ว่า`,
        `ธรรมเป็นที่สิ้นอาสวะ 10 ประการ`,
        `ธรรม 10 ประการนี้`,
        `อันบุคคลเจริญแล้วทำให้มากแล้ว`,
        `ย่อมเป็นไปเพื่อความสิ้นไป`,
        `แห่งอาสวะทั้งหลาย`,
        `ธรรม 10 ประการเป็นไฉน`,
        `คือสัมมาทิฏฐิ`,
        `สัมมาสังกัปปะ`,
        `สัมมาวาจา`,
        `สัมมากัมมันตะ`,
        `สัมมาอาชีวะ`,
        `สัมมาวายามะ`,
        `สัมมาสติ`,
        `สัมมาสมาธิ`,
        `สัมมาญาณะ`,
        `สัมมาวิมุติ`,
        `ธรรม 10 ประการนี้`,
        `อันบุคคลเจริญแล้วทำให้มากแล้ว`,
        `ย่อมเป็นไปเพื่อความสิ้นไป`,
        `แห่งอาสวะทั้งหลาย`,

        `พระพุทธเจ้าตรัสไว้ว่า`,
        `การจักแสดงสิ่งที่ดี`,
        `และสิ่งที่ไม่ดีแก่เธอทั้งหลาย`,
        `สิ่งที่ไม่ดีเป็นไฉน`,
        `คือมิจฉาทิฏฐิ ความเห็นผิด`,
        `มิจฉาสังกัปปะ ความดำริผิด`,
        `มิจฉาวาจา เจรจาผิด`,
        `มิจฉากัมมันตะ การงานผิด`,
        `มิจฉาอาชีวะ เลี้ยงชีพผิด`,
        `มิจฉาวายามะ ความพยายามผิด`,
        `มิจฉาสติ ความระลึกผิด`,
        `มิจฉาสมาธิ ตั้งใจผิด`,
        `มิจฉาญาณะ รู้ผิด`,
        `มิจฉาวิมุติ หลุดพ้นผิด`,
        `นี้เรียกว่าสิ่งที่ไม่ดี`,

        `ก็สิ่งที่ดีเป็นไฉน`,
        `คือสัมมาทิฏฐิ ความเห็นชอบ`,
        `สัมมาสังกัปปะ ความดำริชอบ`,
        `สัมมาวาจา เจรจาชอบ`,
        `สัมมากัมมันตะ การงานชอบ`,
        `สัมมาอาชีวะ เลี้ยงชีพชอบ`,
        `สัมมาวายามะ ความเพียรชอบ`,
        `สัมมาสติ ระลึกชอบ`,
        `สัมมาสมาธิ ตั้งใจชอบ`,
        `สัมมาญาณะ ความรู้ชอบ`,
        `สัมมาวิมุติ ความหลุดพ้นชอบ`,
        `นี้เรียกว่าสิ่งที่ดี`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ถ้ามีคนพึงถามอย่างนี้ว่า</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0310" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0309

export const Head = () => (
  <SEO title="Lesson0309" />
)