import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain03.mp4'
import '../scss/main.scss'


// markup
const Lesson0410 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ฐานสูตร`,
        `ว่าด้วยฐานะ`,
        `ที่ควรพิจารณาเนืองๆ 5 ประการ`,
        `ดูกรภิกษุทั้งหลายฐานะ 5 ประการนี้`,
        `อันสตรี บุรุษ คฤหัสถ์หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆ 5 ประการเป็นไฉน`,
        `คือ สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความแก่เป็นธรรมดา`,
        `ไม่ล่วงพ้นความแก่ไปได้ 1 `,
        `เรามีความเจ็บไข้เป็นธรรมดา`,
        `ไม่ล่วงพ้นความเจ็บไข้ไปได้ 1 `,
        `เรามีความตายเป็นธรรมดา`,
        `ไม่ล่วงพ้นความตายไปได้ 1`,
        `เราต้องพลัดพรากจากของรัก`,
        `ของชอบใจทั้งสิ้น 1 `,
        `เรามีกรรมเป็นของตน`,
        `เป็นทายาทแห่งกรรม`,
        `มีกรรมเป็นกำเนิด`,
        `มีกรรมเป็นเผ่าพันธุ์`,
        `มีกรรมเป็นที่พึ่ง `,
        `จะทำกรรมใดไว้ดีก็ตาม`,
        `ชั่วก็ตาม`,
        `เราจะเป็นผู้รับผลของกรรมนั้น 1 `,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์อะไร`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความแก่เป็นธรรมดา`,
        `ไม่ล่วงพ้นความแก่ไปได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `ความมัวเมาในความเป็นหนุ่มสาว`,
        `มีอยู่แก่สัตว์ทั้งหลาย`,
        `ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย`,
        `ประพฤติทุจริตด้วยกายวาจาใจ`,
        `เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ`,
        `ย่อมละความมัวเมา`,
        `ในความเป็นหนุ่มสาวนั้นได้`,
        `โดยสิ้นเชิง`,
        `หรือทำให้เบาบางลงได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์นี้แล`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความแก่เป็นธรรมดา`,
        `ไม่ล่วงพ้นความแก่ไปได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์อะไร`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความเจ็บไข้เป็นธรรมดา`,
        `ไม่ล่วงพ้นความเจ็บไข้ไปได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `ความมัวเมาในความไม่มีโรค`,
        `มีอยู่แก่สัตว์ทั้งหลาย`,
        `ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย`,
        `ประพฤติทุจริตด้วยกายวาจาใจ`,
        `เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ`,
        `ย่อมละความมัวเมา`,
        `ในความไม่มีโรคนั้นได้`,
        `โดยสิ้นเชิง`,
        `หรือทำให้เบาบางลงได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์นี้แล`,
        `สตรี บุรุษ คฤหัสถ์หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความเจ็บไข้เป็นธรรมดา`,
        `ไม่ล่วงพ้นความเจ็บไข้ไปได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์อะไร`,
        `สตรี บุรุษ คฤหัสถ์หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความตายเป็นธรรมดา`,
        `ไม่ล่วงพ้นความตายไปได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `ความเมาในชีวิตมีอยู่แก่สัตว์ทั้งหลาย`,
        `ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย`,
        `ประพฤติทุจริตด้วยกายวาจาใจ`,
        `เมื่อเข้าพิจารณาฐานะนั้นอยู่เนืองๆ`,
        `ย่อมละความมัวเมาในชีวิตนั้นได้`,
        `โดยสิ้นเชิง`,
        `หรือทำให้เบาบางลงได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์นี้แล`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีความตายเป็นธรรมดา`,
        `ไม่ล่วงพ้นความตายไปได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์อะไร`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `จึงควรพิจารณาเนืองๆว่า`,
        `เราจะต้องพลัดพรากจากของรัก`,
        `ของชอบใจทั้งสิ้น`,
        `ดูกรภิกษุทั้งหลาย`,
        `ความพอใจ ความรักใคร่`,
        `ในของรักมีอยู่แก่สัตว์ทั้งหลาย`,
        `ซึ่งเป็นเหตุให้สัตว์ทั้งหลาย`,
        `ประพฤติทุจริตด้วยกายวาจาใจ`,
        `เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ`,
        `ย่อมละความพอใจความรักใคร่นั้นได้`,
        `โดยสิ้นเชิง`,
        `หรือทำให้เบาบางลงได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์นี้แล`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เราจะต้องพลัดพรากจากของรัก`,
        `ของชอบใจทั้งสิ้น`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์อะไร`,
        `สตรี บุรุษ คฤหัสถ์ หรือบรรพชิต`,
        `ควรพิจารณาเนืองๆว่า`,
        `เรามีกรรมเป็นของตน`,
        `เป็นทายาทแห่งกรรม`,
        `มีกรรมเป็นกำเนิด`,
        `มีกรรมเป็นเผ่าพันธุ์`,
        `มีกรรมเป็นที่พึ่ง`,
        `จะทำกรรมใดดีก็ตามชั่วก็ตาม`,
        `เราจะเป็นผู้รับผลของกรรมนั้น`,
        `ดูกรภิกษุทั้งหลาย`,
        `กายทุจริตวจีทุจริตมโนทุจริต`,
        `มีอยู่แก่สัตว์ทั้งหลาย`,
        `เมื่อเขาพิจารณาฐานะนั้นอยู่เนืองๆ`,
        `ย่อมละทุจริตได้โดยสิ้นเชิง`,
        `หรือทำให้เบาบางลงได้`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอาศัยอำนาจประโยชน์นี้แล`,
        `สตรี บุรุษ คฤหัสถ์หรือบรรพชิต`,
        `จึงควรพิจารณาเนืองๆว่า`,
        `เรามีกรรมเป็นของตน`,
        `เป็นทายาทแห่งกรรม`,
        `มีกรรมเป็นกำเนิด`,
        `มีกรรมเป็นเผ่าพันธุ์`,
        `มีกรรมเป็นที่พึ่ง`,
        `จะทำกรรมใดดีก็ตามชั่วก็ตาม`,
        `เราจะเป็นผู้รับผลของกรรมนั้น`,
        ``,
        `ว่าด้วยผลแห่งการพิจารณาฐานะ 5`,
        `ดูกรภิกษุทั้งหลาย`,
        `อริยสาวกนั้นย่อมพิจารณา`,
        `เห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น`,
        `ที่มีความแก่เป็นธรรมดา`,
        `ไม่ล่วงพ้นความแก่ไปได้`,
        `โดยที่แท้สัตว์ทั้งปวงบรรดา`,
        `ที่มีการมาการไปการจุติการอุปบัติ`,
        `ล้วนมีความแก่เป็นธรรมดา`,
        `ไม่ล่วงพ้นความแก่ไปได้`,
        `เมื่ออริยสาวกนั้น`,
        `พิจารณาฐานะนั้นอยู่เนืองๆ`,
        `มรรคย่อมเกิดขึ้น`,
        `อริยสาวกนั้นย่อมเสพอบรม`,
        `ทำให้มากซึ่งมรรคนั้น`,
        `เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่`,
        `ย่อมละสังโยชน์ได้`,
        `อนุสัยย่อมสิ้นไป`,
        `อริยสาวกนั้นย่อมพิจารณา`,
        `เห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น`,
        `ที่มีความเจ็บไข้เป็นธรรมดา`,
        `ไม่ล่วงพ้นความเจ็บไข้ไปได้`,
        `โดยที่แท้สัตว์ทั้งปวง`,
        `บรรดาที่มีการมาการไปการจุติการอุปบัติ`,
        `ล้วนมีความเจ็บไข้เป็นธรรมดา`,
        `ไม่ล่วงพ้นความเจ็บไข้ไปได้`,
        `เมื่ออริยสาวกนั้นพิจารณาฐานะ`,
        `นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น`,
        `อริยสาวกนั้นย่อมเสพอบรม`,
        `ทำให้มากซึ่งมรรคนั้น`,
        `เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่`,
        `ย่อมละสังโยชน์ได้อนุสัยย่อมสิ้นไป`,
        `อริยสาวกนั้นย่อมพิจารณา`,
        `เห็นดังนี้ว่าไม่ใช่เราแต่ผู้เดียวเท่านั้น`,
        `ที่มีความตายเป็นธรรมดา`,
        `ไม่ล่วงพ้นความตายไปได้`,
        `โดยที่แท้สัตว์ทั้งปวง`,
        `บรรดาที่มีการมาการไปการจุติการอุปบัติ`,
        `ล้วนมีความตายเป็นธรรมดา`,
        `ไม่ล่วงพ้นความตายไปได้เมื่อ`,
        `อริยสาวกนั้นพิจารณาฐานะ`,
        `นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น`,
        `อริยสาวกนั้นย่อมเสพอบรม`,
        `ทำให้มากซึ่งมรรคนั้น`,
        `เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่`,
        `ย่อมละสังโยชน์ได้อนุสัยย่อมสิ้นไป`,
        `อริยสาวกนั้นย่อมพิจารณาเห็นดังนี้ว่า`,
        `ไม่ใช่เราแต่ผู้เดียวเท่านั้นที่จะต้อง`,
        `พลัดพรากจากของรักของชอบใจทั้งสิ้น`,
        `โดยที่แท้สัตว์ทั้งปวง`,
        `บรรดาที่มีการมาการไปการจุติการอุปบัติ`,
        `ล้วนจะต้องพลัดพรากจากของรัก`,
        `ของชอบใจทั้งสิ้น`,
        `เมื่ออริยสาวกนั้นพิจารณาฐานะ`,
        `นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น`,
        `อริยสาวกนั้นย่อมเสพอบรม`,
        `ทำให้มากซึ่งมรรคนั้น`,
        `เมื่อเสพอบรมทำให้มากซึ่งมรรคนั้นอยู่`,
        `ย่อมละสังโยชน์ได้`,
        `อนุสัยย่อมสิ้นไป`,
        `อริยสาวกนั้นย่อมพิจารณาเห็นดังนี้ว่า`,
        `ไม่ใช่เราแต่ผู้เดียวเท่านั้น`,
        `ที่มีกรรมเป็นของตน`,
        `เป็นทายาทแห่งกรรม`,
        `มีกรรมเป็นกำเนิด`,
        `มีกรรมเป็นเผ่าพันธุ์`,
        `มีกรรมเป็นที่พึ่ง`,
        `จักทำกรรมใดดีก็ตามชั่วก็ตาม`,
        `เราจะเป็นผู้รับผลของกรรมนั้น`,
        `โดยที่แท้สัตว์ทั้งปวง`,
        `บรรดาที่มีการมาการไปการจุติการอุปบัติ`,
        `ล้วนมีกรรมเป็นของตน`,
        `เป็นทายาทแห่งกรรม`,
        `มีกรรมเป็นกำเนิด`,
        `มีกรรมเป็นเผ่าพันธุ์`,
        `มีกรรมเป็นที่พึ่ง`,
        `จะทำกรรมใดดีก็ตามชั่วก็ตาม`,
        `จะเป็นผู้รับผลของกรรมนั้น`,
        `เมื่ออริยสาวกนั้นพิจารณาฐานะ`,
        `นั้นอยู่เนืองๆมรรคย่อมเกิดขึ้น`,
        `อริยสาวกนั้นย่อมเสพอบรม`,
        `ทำให้มากซึ่งมรรคนั้นอยู่`,
        `ย่อมละสังโยชน์ได้`,
        `อนุสัยย่อมสิ้นไป`,
        `สัตว์ทั้งหลายย่อม`,
        `มีความแก่เป็นธรรมดา`,
        `มีความเจ็บไข้เป็นธรรมดา`,
        `มีความตายเป็นธรรมดา`,
        `สัตว์ทั้งหลายย่อมเป็นไปตามธรรมดา`,
        `พวกปุถุชนย่อมเกลียด`,
        `ถ้าเราพึงเกลียดธรรมนั้น`,
        `ในพวกสัตว์ผู้มีอย่างนั้นเป็นธรรมดา`,
        `ข้อนั้นไม่สมควรแก่เราผู้เป็นอยู่อย่างนี้`,
        `เรานั้นเป็นอยู่อย่างนี้`,
        `ทราบทำที่หาอุปธิมิได้`,
        `เห็นการออกบวช`,
        `โดยเป็นธรรมเกษม`,
        `ครอบงำความมัวเมาทั้งปวง`,
        `ในความไม่มีโรค`,
        `ในความเป็นหนุ่มสาว`,
        `และในชีวิตความอุตสาหะได้มีแล้วแก่เรา`,
        `ผู้เห็นเฉพาะซึ่งนิพพาน`,
        `บัดนี้เราไม่ควรเพื่อเสพกามทั้งหลาย`,
        `จะเป็นผู้ประพฤติไม่ถอยหลัง`,
        `ตั้งหน้าประพฤติพรหมจรรย์`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ฐานสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0410

export const Head = () => (
  <SEO title="Lesson0410" />
)