import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain03.mp4'
import '../scss/main.scss'


// markup
const Lesson0405 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `โนอัสสาสูตรที่ 2`,
        `ดูกรภิกษุทั้งหลาย`,
        `ถ้าคุณแห่งรูปจักไม่มีแล้วไซร้`,
        `สัตว์ทั้งหลาย`,
        `ก็จะไม่พึงกำหนัดในรูป`,
        `แต่เพราะคุณของรูปมีอยู่`,
        `ฉะนั้นสัตว์ทั้งหลาย`,
        `จึงกำหนัดในรูป`,
        `ถ้าโทษแห่งรูปไม่มีแล้วไซร้`,
        `สัตว์ทั้งหลาย`,
        `ก็จะไม่พึงเบื่อหน่ายในรูป`,
        `แต่เพราะโทษแห่งรูปมีอยู่`,
        `ฉะนั้นสัตว์ทั้งหลาย`,
        `จึงเบื่อหน่ายในรูป`,
        `ถ้าความสลัดออกแห่งรูป`,
        `จักไม่มีแล้วไซร้`,
        `สัตว์ทั้งหลาย`,
        `ก็จะไม่พึงสลัดออกจากรูป`,
        `แต่เพราะความสลัดออกแห่งรูปมีอยู่`,
        `ฉะนั้นสัตว์ทั้งหลาย`,
        `จึงสลัดออกแห่งรูป ฯลฯ`,
        `แห่งเสียง ฯลฯ`,
        `แห่งกลิ่น ฯลฯ`,
        `แห่งรส ฯลฯ`,
        `แห่งโผฏฐัพพะ ฯลฯ`,
        `ถ้าคุณแห่งธรรมารมณ์`,
        `จักไม่มีแล้วไซร้`,
        `สัตว์ทั้งหลาย`,
        `ไม่พึงกำหนัดในธรรมารมณ์`,
        `แต่เพราะคุณแห่งธรรมารมณ์มีอยู่`,
        `ฉะนั้นสัตว์ทั้งหลาย`,
        `พึงกำหนัดในธรรมารมณ์`,
        `ถ้าโทษแห่งธรรมารมณ์`,
        `จักไม่มีแล้วไซร้`,
        `สัตว์ทั้งหลาย`,
        `ก็ไม่พึงเบื่อหน่ายในธรรมารมณ์`,
        `แต่เพราะโทษแห่งธรรมารมณ์มีอยู่`,
        `ฉะนั้นสัตว์ทั้งหลาย`,
        `จึงเบื่อหน่ายในธรรมารมณ์`,
        `ถ้าความสลัดออก`,
        `จากธรรมารมณ์จักไม่มีแล้วไซร้`,
        `สัตว์ทั้งหลาย`,
        `ก็จะไม่พึงสลัดออกจากธรรมารมณ์`,
        `แต่เพราะความสลัดออก`,
        `จากธรรมารมณ์มีอยู่`,
        `ฉะนั้นสัตว์ทั้งหลาย`,
        `จึงสลัดออกจากธรรมารมณ์`,
        `ดูกรภิกษุทั้งหลาย`,
        `สัตว์ทั้งหลาย`,
        `ยังไม่รู้ตามความเป็นจริง`,
        `ซึ่งคุณแห่งอายตนะภายนอก 6 เหล่านี้`,
        `โดยเป็นคุณ`,
        `ซึ่งโทษโดยความเป็นโทษ`,
        `ซึ่งความสลัดออก`,
        `โดยเป็นความสลัดออกเพียงใด`,
        `สัตว์ทั้งหลายก็ยังเป็นผู้ไม่ออกไป`,
        `พรากไป`,
        `หลุดพ้นจากโลก`,
        `พร้อมเทวโลก มารโลก พรหมโลก`,
        `จากหมู่สัตว์`,
        `พร้อมทั้งสมณพราหมณ์เทวดาและมนุษย์`,
        `มีใจหาเขตแดนไม่ได้อยู่เพียงนั้น`,
        `แต่เมื่อใดสัตว์ทั้งหลายได้รู้ตามความเป็นจริง`,
        `ซึ่งคุณแห่งอายตนะ 6 เหล่านี้`,
        `โดยเป็นคุณ`,
        `ซึ่งโทษโดยความเป็นโทษ`,
        `ซึ่งความสลัดออก`,
        `โดยเป็นความสลัดออก`,
        `เมื่อนั้นสัตว์ทั้งหลายก็เป็นผู้ออกไป`,
        `หลุดพ้นไปจากโลก`,
        `พร้อมทั้งเทวโลก มารโลก พรหมโลก`,
        `จากหมู่สัตว์`,
        `พร้อมทั้งสมณพราหมณ์`,
        `เทวดาและมนุษย์`,
        `มีใจอันหาเขตแดนมิได้อยู่`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">โนอัสสาสูตรที่ 2</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0406" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0405