import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain03.mp4'
import '../scss/main.scss'


// markup
const Lesson0407 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ขัตติยาธิปปายสูตร`,
        `ว่าด้วยความประสงค์`,
        `ของคน 6 จำพวก`,
        `ครั้งนั้นแลชานุสโสนิพราหมณ์`,
        `เข้าไปเฝ้าพระผู้มีพระภาค`,
        `ถึงที่ประทับ`,
        `ได้ปราศรัยกับพระผู้มีพระภาค`,
        `ครั้นผ่านการปราศรัย`,
        `พอให้ระลึกถึงกันไปแล้ว`,
        `จึงนั่ง ณ ที่ควรส่วนข้างหนึ่ง`,
        `ครั้นแล้วได้ทูลถาม`,
        `พระผู้มีพระภาคว่า`,
        
        `ชานุสโสนิพราหมณ์`,
        `ถามพระพุทธเจ้าว่า`,
        `ข้าแต่พระโคดมผู้เจริญ`,
        `กษัตริย์ทั้งหลาย`,
        `ย่อมมีความประสงค์อะไร`,
        `นิยมอะไร`,
        `มั่นใจอะไร`,
        `ต้องการอะไร`,
        `มีอะไรเป็นที่สุด`,

        `พระผู้มีพระภาค`,
        `ตรัสตอบว่า`,
        `ดูกรพราหมณ์`,
        `ธรรมดากษัตริย์ทั้งหลาย`,
        `ย่อมประสงค์โภคทรัพย์`,
        `นิยมปัญญา`,
        `มั่นใจในกำลังทหาร`,
        `ต้องการในการได้แผ่นดิน`,
        `มีความเป็นใหญ่เป็นที่สุด`,

        `ชานุสโสนิพราหมณ์`,
        `ถามพระพุทธเจ้าต่อไปว่า`,
        `ข้าแต่พระโคดมผู้เจริญ`,
        `ก็พราหมณ์ทั้งหลาย`,
        `ย่อมมีความประสงค์อะไร`,
        `นิยมอะไร`,
        `มั่นใจอะไร`,
        `ต้องการอะไร`,
        `มีอะไรเป็นที่สุด`,
        `พระผู้มีพระภาค`,
        `ตรัสตอบว่า`,
        `ดูกรพราหมณ์`,
        `ธรรมดาพราหมณ์ทั้งหลาย`,
        `ย่อมประสงค์โภคทรัพย์`,
        `นิยมปัญญา`,
        `มั่นใจในมนต์`,
        `ต้องการบูชายัญ`,
        `มีพรหมโลกเป็นที่สุด`,

        `ชานุสโสนิพราหมณ์`,
        `ถามพระพุทธเจ้าต่อไปว่า`,
        `ข้าแต่พระโคดมผู้เจริญ`,
        `ก็คฤหบดีทั้งหลาย`,
        `ย่อมมีความประสงค์อะไร`,
        `นิยมอะไร`,
        `มั่นใจในอะไร`,
        `ต้องการอะไร`,
        `มีอะไรเป็นที่สุด`,

        `พระผู้มีพระภาค`,
        `ตรัสตอบว่า`,
        `ดูกรพราหมณ์`,
        `ธรรมดาคฤหบดีทั้งหลาย`,
        `ย่อมประสงค์โภคทรัพย์`,
        `นิยมปัญญา`,
        `มั่นใจในศิลปะ`,
        `ต้องการการงาน`,
        `มีการงานที่สำเร็จแล้วเป็นที่สุด`,

        `ชานุสโสนิพราหมณ์`,
        `ถามพระพุทธเจ้าต่อไปว่า`,
        `ข้าแต่พระโคดมผู้เจริญ`,
        `ก็สตรีทั้งหลาย`,
        `ย่อมประสงค์อะไร`,
        `นิยมอะไร`,
        `มั่นใจในอะไร`,
        `ต้องการอะไร`,
        `มีอะไรเป็นที่สุด`,
        `พระผู้มีพระภาค`,
        `ตรัสตอบว่า`,
        `ดูกรพราหมณ์`,
        `ธรรมดาสตรีทั้งหลาย`,
        `ย่อมประสงค์บุรุษ`,
        `นิยมเครื่องแต่งตัว`,
        `มั่นใจในบุตร`,
        `ต้องการไม่ให้สตรีอื่นร่วมสามี`,
        `มีความเป็นใหญ่ในบ้านเป็นที่สุด`,

        `ชานุสโสนิพราหมณ์`,
        `ถามพระพุทธเจ้าต่อไปว่า`,
        `ข้าแต่พระโคดมผู้เจริญ`,
        `ก็โจรทั้งหลาย`,
        `ย่อมประสงค์อะไร`,
        `นิยมอะไร`,
        `มั่นใจอะไร`,
        `ต้องการอะไร`,
        `มีอะไรเป็นที่สุด`,

        `พระผู้มีพระภาค`,
        `ตรัสตอบว่า`,
        `ดูกรพราหมณ์โจรทั้งหลาย`,
        `ย่อมประสงค์ลักทรัพย์ของผู้อื่น`,
        `นิยมที่เร้นลับ`,
        `มั่นใจในศาสตรา`,
        `ต้องการที่มืด`,
        `มีการที่ผู้อื่นไม่เห็นเขาเป็นที่สุด`,

        `ชานุสโสนิพราหมณ์`,
        `ถามพระพุทธเจ้าต่อไปว่า`,
        `ข้าแต่พระโคดมผู้เจริญ`,
        `ก็สมณะทั้งหลาย`,
        `ย่อมประสงค์อะไร`,
        `นิยมอะไร`,
        `มั่นใจอะไร`,
        `ต้องการอะไร`,
        `มีอะไรเป็นที่สุด`,

        `พระผู้มีพระภาค`,
        `ตรัสตอบว่า`,
        `ดูกรพราหมณ์`,
        `ธรรมดาสมณะทั้งหลาย`,
        `ย่อมประสงค์ขันติโสรัจจะ`,
        `นิยมปัญญา`,
        `มั่นใจในศีล`,
        `ต้องการความไม่มีห่วงใย`,
        `มีพระนิพพานเป็นที่สุด`,

        `ข้าแต่พระโคดมผู้เจริญ`,
        `อัศจรรย์เรื่องไม่เคยมีได้มีแล้ว`,
        `คือท่านพระโคดม`,
        `ย่อมทรงทราบความประสงค์`,
        `ความนิยม`,
        `ความมั่นใจ`,
        `ความต้องการ`,
        `และสิ่งที่เป็นที่สุด`,
        `แห่งกษัตริย์ทั้งหลายฯลฯ`,
        `แห่งพราหมณ์ทั้งหลายฯลฯ`,
        `แห่งคฤหบดีทั้งหลายฯลฯ`,
        `แม้แห่งสตรีทั้งหลายฯลฯ`,
        `แม้แห่งโจรทั้งหลายฯลฯ`,
        `ย่อมทรงทราบความประสงค์`,
        `ความนิยม`,
        `ความมั่นใจ`,
        `ความต้องการ`,
        `และสิ่งที่เป็นที่สุด`,
        `แห่งสมณะทั้งหลาย`,
        `ข้าแต่ท่านพระโคดมผู้เจริญ`,
        `ภาษิตของพระองค์แจ่มแจ้งนัก`,
        `ข้าแต่ท่านพระโคดมผู้เจริญ`,
        `ภาษิตของพระองค์แจ่มแจ้งนัก`,
        `ขอท่านพระโคดมทรงจำข้าพระองค์`,
        `ว่าเป็นอุบาสกผู้ถึงสรณะตลอดชีวิต`,
        `ตั้งแต่วันนี้เป็นต้นไป`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ขัตติยาธิปปายสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0408" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0407

export const Head = () => (
  <SEO title="Lesson0407" />
)