import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0211 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ความคิด โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เท้าเดิน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `มือจับ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เหลียวซ้าย โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เหลียวขวา โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`, 
        `ก้มหน้า โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เงยหน้า โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ยืน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เดิน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `นั่ง โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `นอน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ตื่นนอน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ลืมตา โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ที่นอน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ผ้าห่ม โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ล้างหน้า โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `แปรงฟัน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `อาบน้ำ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ใส่เสื้อ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ใส่กางเกง โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `หวีผม โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `แต่งหน้า โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ไปทานข้าว โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `จาน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ช้อน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ข้าว โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `กับข้าว โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดื่มน้ำ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดื่มกาแฟ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ไปทำงาน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ขับรถ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ที่ทำงาน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เพื่อนร่วมงาน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `นั่งเก้าอี้ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `จับปากกา โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เขียนหนังสือ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เข้าห้องน้ำ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เลิกงาน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `กลับบ้าน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ซื้อของ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เข้าบ้าน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ให้อาหารสัตว์ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `รดน้ำต้นไม้ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `กวาดบ้าน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ถูพื้น โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ซักผ้า โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ไม้แขวนเสื้อ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ตากผ้า โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `กินข้าวเย็น โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `อาบน้ำ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เปิดพัดลม โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เปิดแอร์ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดูทีวี โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ฟังเพลง โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `โทรศัพท์ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ปิดไฟ โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `เข้านอน โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `การเคลื่อนไหว โลกและชีวิตความรู้สึก`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `นี่คือผลต่อเนื่องของโลกและชีวิต`,
        `กำหนดรู้ว่าทั้งหมดเป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">    
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>  
              <h1><div className="text">โลกและชีวิตความรู้สึกเป็นอันเดียวกัน</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0212" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0211