import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain04.mp4'
import '../scss/main.scss'


// markup
const Lesson0509 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ติมพรุกขสูตร`,
        `ว่าด้วยสุขและทุกข์`,
        `พระผู้มีพระภาค`,
        `ประทับอยู่ ณ พระเชตวัน`,
        `อารามของท่านอนาถบิณฑิกเศรษฐี`,
        `เขตพระนครสาวัตถี`,
        `ครั้งนั้นแลปริพาชกชื่อว่าติมพรุกขะ`,
        `เข้าไปเฝ้าพระผู้มีพระภาคถึงที่ประทับ`,
        `ครั้นแล้วได้ปราศรัยกับพระผู้มีพระภาค`,
        `ครั้นผ่านการปราศรัย`,
        `พอให้ระลึกถึงกันไปแล้ว`,
        `จึงนั่งณที่ควรส่วนข้างหนึ่ง`,
        `ครั้นแล้วติมพรุกขปริพาชก`,
        `ได้ทูลถามพระผู้มีพระภาคว่า`,
        `ติมพรุกขะทูลถามพระผู้มีพระภาคว่า`,
        `ข้าแต่ท่านพระโคดม`,
        `สุขและพวกตนกระทำเองหรือ`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `อย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า`,
        `สุขและทุกข์ผู้อื่นกระทำให้หรือท่านพระโคดม`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `อย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า`,
        `สุขและทุกข์ตนกระทำเองด้วย`,
        `ผู้อื่นกระทำให้ด้วยหรือท่านพระโคดม`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `อย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า`,
        `สุขและทุกข์บังเกิดขึ้น`,
        `เพราะอาศัยการที่มิใช่ตนเองกระทำ`,
        `มิใช่ผู้อื่นกระทำให้หรือท่านพระโคดม`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `อย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า`,
        `สุขและทุกข์ไม่มีหรือท่านพระโคดม`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `สุขและทุกข์ไม่มีหาไม่ได้`,
        `สุขและทุกข์มีอยู่ติมพรุกขะ`,
        `ติมพรุกขะทูลถามพระผู้มีพระภาคต่อไปว่า`,
        `ถ้าอย่างนั้นท่านพระโคดม`,
        `ย่อมไม่รู้ไม่เห็นสุขและทุกข์`,
        `พระผู้มีพระภาคตรัสตอบว่า`,
        `เราย่อมไม่รู้ไม่เห็นสุขและทุกข์หาไม่ได้`,
        `เรารู้เห็นสุขและทุกข์อยู่ติมพรุกขะ`,
        `เมื่อข้าพเจ้าถามว่า`,
        `ข้าแต่ท่านพระโคดมสุขและทุกข์`,
        `ตนกระทำเองหรือ`,
        `ท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `เมื่อข้าพเจ้าถามว่า`,
        `สุขและทุกข์ผู้อื่นกระทำให้หรือ`,
        `ท่านพระโคดม`,
        `ท่านตรัสว่า`,
        `อย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `เมื่อข้าพเจ้าถามว่า`,
        `สุขและทุกข์ตนกระทำเองด้วย`,
        `ผู้อื่นกระทำให้ด้วยหรือท่านพระโคดม`,
        `ท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `เมื่อข้าพเจ้าถามว่าสุขและทุกข์บังเกิดขึ้น`,
        `เพราะอาศัยการที่ไม่ใช่ตนเองกระทำ`,
        `ไม่ใช่ผู้อื่นกระทำให้หรือท่านพระโคดม`,
        `ท่านตรัสว่าอย่ากล่าวอย่างนั้นติมพรุกขะ`,
        `เมื่อข้าพเจ้าถามว่าสุขและทุกข์ไม่มีหรือ`,
        `ท่านตรัสว่าสุขและทุกข์ไม่มีหาไม่ได้`,
        `สุขและทุกข์มีอยู่ติมพรุกขะ`,
        `เมื่อข้าพเจ้าถามว่า`,
        `ถ้าอย่างนั้นท่านพระโคดม`,
        `ย่อมไม่รู้ไม่เห็นสุขและทุกข์`,
        `ท่านตรัสว่า`,
        `เราย่อมไม่รู้ไม่เห็นสุขและทุกข์หาไม่ได้`,
        `เราเห็นสุขและทุกข์อยู่ติมพรุกขะ`,
        `ท่านพระโคดมจงตรัสบอกสุขและทุกข์`,
        `แก่ข้าพเจ้าขอท่านพระโคดม`,
        `จงทรงแสดงสุขและทุกข์แก่ข้าพเจ้า`,
        
        `พระผู้มีพระภาคตรัสว่า`,
        `ดูกรติมพรุกขะ`,
        `เมื่อบุคคลถืออยู่ว่านั่นเวทนา`,
        `นั่นผู้เสวยดังนี้`,
        `แต่เราไม่กล่าวอย่างนี้ว่า`,
        `สุขและทุกข์ตนกระทำเอง`,
        `เมื่อบุคคลถูกเวทนาทิ่มแทงอยู่ว่า`,
        `เวทนาอย่างหนึ่งผู้เสวยเป็นอีกคนหนึ่งดังนี้`,
        `แต่เราไม่กล่าวอย่างนี้ว่า`,
        `สุขและทุกข์ผู้อื่นกระทำให้`,
        `ดูกรติมพรุกขะตถาคตแสดงธรรม`,
        `โดยสายกลาง`,
        `ไม่เข้าไปใกล้ส่วนสุดทั้งสองนั้นว่า`,
        `เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร`,
        `เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ`,
        `ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้`,
        `เพราะอวิชชานั่นแหละดับ`,
        `ด้วยสำรอกโดยไม่เหลือ`,
        `สังขารจึงดับ`,
        `เพราะสังขารดับวิญญาณจึงดับ`,
        `ความดับแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้`,
        `พระผู้มีพระภาคตรัสอย่างนี้แล้ว`,
        `ติมพรุกขะปริพาชก`,
        `ได้กราบทูลพระผู้มีพระภาคว่า`,
        `ข้าแต่ท่านพระโคดม`,
        `ภาษิตของพระองค์แจ่มแจ้งนัก`,
        `ข้าแต่ท่านพระโคดม`,
        `ภาษิตของพระองค์แจ่มแจ้งนัก`,
        `พระผู้มีพระภาค`,
        `ทรงประกาศธรรมโดยอเนกปริยาย`,
        `เปรียบเหมือนบุคคล`,
        `หงายของที่คว่ำเปิดของที่ปิด`,
        `บอกทางแก่คนหลงทาง`,
        `หรือตามประทีปในที่มืด`,
        `ด้วยประสงค์ว่าผู้มีจักษุ`,
        `จักเห็นรูปฉะนั้น`,
        `ข้าพระองค์ขอถึงท่านพระโคดม`,
        `กับทั้งพระธรรมและพระภิกษุสงฆ์`,
        `เป็นสรณะ`,
        `ขอท่านพระโคดม`,
        `จงทรงจำข้าพระองค์`,
        `ว่าเป็นอุบาสกถึงผู้ถึงสรณะ`,
        `จนตลอดชีวิตจำเดิมแต่วันนี้เป็นต้นไป`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ติมพรุกขสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0510" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0509

export const Head = () => (
  <SEO title="Lesson0509" />
)