import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain.mp4'
import '../scss/main.scss'


// markup
const Lesson0508 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `อาหารสูตร`,
        `ว่าด้วยอาหาร 4 อย่าง`,
        `ข้าพเจ้าได้สดับมาอย่างนี้`,
        `สมัยหนึ่งพระผู้มีพระภาค`,
        `ประทับอยู่ ณ พระเชตวัน`,
        `อารามของท่านอนาถบิณฑิกเศรษฐี`,
        `เขตพระนครสาวัตถี`,
        `พระผู้มีพระภาคได้ตรัสว่า`,
        `ดูกรภิกษุทั้งหลาย`,
        `อาหาร 4 เหล่านี้ย่อมเป็นไป`,
        `เพื่อความดำรงอยู่ของหมู่สัตว์`,
        `ผู้เกิดมาแล้ว`,
        `หรือเพื่ออนุเคราะห์หมู่สัตว์`,
        `ผู้แสวงหาที่เกิด`,
        `อาหาร 4 เป็นไฉน`,
        `คือ 1 กวฬิงการาหารหยาบหรือละเอียด `,
        `2 ผัสสาหาร`,
        `3 มโนสัญเจตนาหาร `,
        `4 วิญญาณาหาร`,
        `อาหาร 4 เหล่านี้แลย่อมเป็นไป`,
        `เพื่อความดำรงอยู่ของหมู่สัตว์`,
        `ผู้เกิดมาแล้ว`,
        `หรือเพื่ออนุเคราะห์หมู่สัตว์`,
        `ผู้แสวงหาที่เกิด`,
        `ดูกรภิกษุทั้งหลาย`,
        `ก็อาหาร 4 เหล่านี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `อาหาร 4 เหล่านี้มีตัณหาเป็นเหตุ`,
        `มีตัณหาเป็นที่ตั้งขึ้น`,
        `มีตัณหาเป็นกำเนิด`,
        `มีตัณหาเป็นแดนเกิด`,
        `ก็ตัณหานี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `ตัณหามีเวทนาเป็นเหตุ`,
        `มีเวทนาเป็นที่ตั้งขึ้น`,
        `มีเวทนาเป็นกำเนิด`,
        `มีเวทนาเป็นแดนเกิด`,
        `ก็เวทนานี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `เวทนามีผัสสะเป็นเหตุ`,
        `มีผัสสะเป็นที่ตั้งขึ้น`,
        `มีผัสสะเป็นกำเนิด`,
        `มีผัสสะเป็นแดนเกิด`,
        `ก็ผัสสะนี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `ผัสสะมีสฬายตนะเป็นเหตุ`,
        `มีสฬายตนะเป็นที่ตั้งขึ้น`,
        `มีสฬายตนะเป็นกำเนิด`,
        `มีสฬายตนะเป็นแดนเกิด`,
        `ก็สฬายตนะนี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `สฬายตนะมีนามรูปเป็นเหตุ`,
        `มีนามรูปเป็นที่ตั้งขึ้น`,
        `มีนามรูปเป็นกำเนิด`,
        `มีนามรูปเป็นแดนเกิด`,
        `ก็นามรูปนี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `นามรูปมีวิญญาณเป็นเหตุ`,
        `มีวิญญาณเป็นที่ตั้งขึ้น`,
        `มีวิญญาณเป็นกำเนิด`,
        `มีวิญญาณเป็นแดนเกิด`,
        `ก็วิญญาณนี้มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `วิญญาณมีสังขารเป็นเหตุ`,
        `มีสังขารเป็นที่ตั้งขึ้น`,
        `มีสังขารเป็นกำเนิด`,
        `มีสังขารเป็นแดนเกิด`,
        `ก็สังขารเหล่านี้`,
        `มีอะไรเป็นเหตุ`,
        `มีอะไรเป็นที่ตั้งขึ้น`,
        `มีอะไรเป็นกำเนิด`,
        `มีอะไรเป็นแดนเกิด`,
        `สังขารทั้งหลายมีอวิชชาเป็นเหตุ`,
        `มีอวิชชาเป็นที่ตั้งขึ้น`,
        `มีอวิชาเป็นกำเนิด`,
        `มีวิชาเป็นแดนเกิด`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร`,
        `เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ`,
        `ดังพรรณนามาฉะนี้`,
        `ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้`,
        `ก็เพราะอวิชชานั่นแหละดับ`,
        `ด้วยการสำรอกโดยไม่เหลือ`,
        `สังขารจึงดับ`,
        `เพราะสังขารดับวิญญาณจึงดับ`,
        `ความดับแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้ `,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">อาหารสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0509" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0508

export const Head = () => (
  <SEO title="Lesson0508" />
)