import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain.mp4'
import '../scss/main.scss'


// markup
const Lesson0205 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ตาเห็นรูป โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ตัวฉัน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `เวทนา สัญญา สังขาร วิญญาณ`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `หูได้ยินเสียง โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ตัวฉัน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `เวทนา สัญญา สังขาร วิญญาณ`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `จมูกได้กลิ่น โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ตัวฉัน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `เวทนา สัญญา สังขาร วิญญาณ`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `ลิ้นได้รส โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ตัวฉัน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `เวทนา สัญญา สังขาร วิญญาณ`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `กายสัมผัส โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ตัวฉัน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `เวทนา สัญญา สังขาร วิญญาณ`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
        
        `ใจคิดนึก โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ตัวฉัน โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `โลกและชีวิต`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `เวทนา สัญญา สังขาร วิญญาณ`,
        `เป็นธรรมชาติชนิดหนึ่ง`,
        `ไม่เที่ยงเกิดดับ`,
        `ดับไม่เหลือเหมือนกัน`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">  
            <a href="/praise" >
              <span className="highlight" style={{fontSize: "2.5em"}}>
                หน้าแรก
              </span>
            </a>    
              <h1><div className="text">วิปัสสนาภาวนาขันธ์ 5 อินทรีย์ 6</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>

          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0206" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0205

export const Head = () => (
  <SEO title="Lesson0205" />
)