import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0307 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `ตาเห็นรูป การเคลื่อนไหวทางตาเกิดขึ้นแล้ว`,
        `เพราะโลกและชีวิตกระทบสัมผัสกันเป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง`,
        `ไม่ควรไปยึดมั่นถือมั่นว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ว่างเปล่าจากตนหรือจากของของตน`,

        `หูได้ยินเสียง การเคลื่อนไหวทางหูเกิดขึ้นแล้ว`,
        `เพราะโลกและชีวิตกระทบสัมผัสกันเป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง`,
        `ไม่ควรไปยึดมั่นถือมั่นว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ว่างเปล่าจากตนหรือจากของของตน`,

        `จมูกได้กลิ่น การเคลื่อนไหวทางจมูกเกิดขึ้นแล้ว`,
        `เพราะโลกและชีวิตกระทบสัมผัสกันเป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง`,
        `ไม่ควรไปยึดมั่นถือมั่นว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ว่างเปล่าจากตนหรือจากของของตน`,

        `ลิ้นได้รส การเคลื่อนไหวทางลิ้นเกิดขึ้นแล้ว`,
        `เพราะโลกและชีวิตกระทบสัมผัสกันเป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง`,
        `ไม่ควรไปยึดมั่นถือมั่นว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ว่างเปล่าจากตนหรือจากของของตน`,

        `กายสัมผัส การเคลื่อนไหวทางกายเกิดขึ้นแล้ว`,
        `เพราะโลกและชีวิตกระทบสัมผัสกันเป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง`,
        `ไม่ควรไปยึดมั่นถือมั่นว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ว่างเปล่าจากตนหรือจากของของตน`,

        `ใจคิดนึก การเคลื่อนไหวทางใจเกิดขึ้นแล้ว`,
        `เพราะโลกและชีวิตกระทบสัมผัสกันเป็นธรรมชาติชนิดหนึ่ง`,
        `เกิดจากเหตุปัจจัยมาประชุมกันชั่วคราวแล้วแตกสลาย`,
        `ไม่มีตัวตนเป็นของตนเอง`,
        `ไม่ควรไปยึดมั่นถือมั่นว่านั่นเป็นของเรา เป็นเรา เป็นตัวตนของเรา`,
        `ไม่เที่ยงเกิดดับ ดับไม่เหลือ`,
        `ว่างเปล่าจากตนหรือจากของของตน`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">คนเราเคลื่อนไหวที่ ตา หู จมูก ลิ้น กาย ใจ</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a href="/lesson0308" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0307