import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import { SEO } from '../components/seo'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain04.mp4'
import '../scss/main.scss'


// markup
const Lesson0507 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `วิภังคสูตร`,
        `ว่าด้วยจำแนกปฏิจจสมุปบาท`,
        `พระผู้มีพระภาคประทับอยู่ ณ พระเชตวัน`,
        `อารามของท่านอนาถบิณฑิกเศรษฐี`,
        `เขตพระนครสาวัตถี`,
        `พระผู้มีพระภาคได้ตรัสว่า`,
        `ดูกรภิกษุทั้งหลาย`,
        `เราจักแสดงจักจำแนก`,
        `ปฏิจจสมุปบาทแก่พวกเธอ`,
        `พวกเธอจงฟังปฏิจจสมุปบาทนั้น`,
        `จงใส่ใจให้ดีเถิดเราจักกล่าว`,
        `ภิกษุเหล่านั้นทูลรับพระผู้มีพระภาคแล้ว`,
        `พระผู้มีพระภาคได้ตรัสว่า`,
        `ดูกรภิกษุทั้งหลาย`,
        `ก็ปฏิจจสมุปบาทเป็นไฉน`,
        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร`,
        `เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ`,
        `เพราะวิญญาณเป็นปัจจัยจึงมีนามรูป`,
        `เพราะนามรูปเป็นปัจจัยจึงมีสฬายตนะ`,
        `เพราะสฬายตนะเป็นปัจจัยจึงมีผัสสะ`,
        `เพราะผัสสะเป็นปัจจัยจึงมีเวทนา`,
        `เพราะเวทนาเป็นปัจจัยจึงมีตัณหา`,
        `เพราะตัณหาเป็นปัจจัยจึงมีอุปาทาน`,
        `เพราะอุปาทานเป็นปัจจัยจึงมีภพ`,
        `เพราะภพเป็นปัจจัยจึงมีชาติ`,
        `เพราะชาติเป็นปัจจัยจึงมีชรา`,
        `และมรณะโสกะปริเทวะ`,
        `ทุกข์โทมนัสและอุปายาส`,
        `ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้`,
        `ดูกรภิกษุทั้งหลาย`,
        `ก็ชราและมรณะเป็นไฉน`,
        `ความแก่ ภาวะของความแก่`,
        `ฟันหลุด ผมหงอก หนังเป็นเกลียว`,
        `ความเสื่อมแห่งอายุ `,
        `ความแก่หง่อมแห่งอินทรีย์`,
        `ในหมู่สัตว์นั้นๆของเหล่าสัตว์นั้นๆ`,
        `นี้เรียกว่าชรา`,
        `ก็มรณะเป็นไฉน`,
        `ความเคลื่อนภาวะของความเคลื่อน`,
        `ความทำลายความอันตรธานมฤตยู`,
        `ความตาย กาลกิริยา`,
        `ความแตกแห่งขันธ์`,
        `ความทอดทิ้งซากศพ`,
        `ความขาดแห่งชีวิตินทรีย์`,
        `จากนั้นของเหล่าสัตว์นั้นๆ`,
        `นี้เรียกว่ามรณะ`,
        `ชราและมรณะดังพรรณนามาฉะนี้`,
        `เรียกว่าชราและมรณะ`,

        `ก็ชาติเป็นไฉน`,
        `ความเกิดความบังเกิด`,
        `ความหยั่งลง`,
        `เกิด`,
        `เกิดจำเพาะ`,
        `ความปรากฏแห่งขันธ์`,
        `ความได้อายตนะครบในหมู่สัตว์นั้นๆ`,
        `ของเหล่าสัตว์นั้นๆ`,
        `นี้เรียกว่าชาติ`,

        `ก็ภพเป็นไฉน`,
        `ภพ 3 เหล่านี้คือ`,
        `กามภพ รูปภพ อรูปภพ`,
        `นี้เรียกว่าภพ`,

        `ก็อุปาทานเป็นไฉน`,
        `อุปาทาน 4 เหล่านี้`,
        `คือกามุปาทาน`,
        `ทิฏฐุปาทาน`,
        `สีลพัตตุปาทาน`,
        `อัตตวาทุปาทาน`,
        `นี้เรียกว่าอุปาทาน`,

        `ก็ตัณหาเป็นไฉน`,
        `ตัณหา 6 หมวดเหล่านี้คือ`,
        `รูปตัณหา สัททตัณหา`,
        `คันธตัณหา รสตัณหา`,
        `โผฏฐัพพะตัณหา ธัมมตัณหา`,
        `นี้เรียกว่าตัณหา`,

        `ก็เวทนาเป็นไฉน`,
        `เวทนา 6 หมวดเหล่านี้คือ`,
        `จักขุสัมผัสสชาเวทนา`,
        `โสตสัมผัสสชาเวทนา`,
        `ฆานสัมมผัสสชาเวทนา`,
        `ชิวหาสัมผัสสชาเวทนา`,
        `กายสัมผัสสชาเวทนา`,
        `มโนสัมผัสสชาเวทนา`,
        `นี้เรียกว่าเวทนา`,

        `ก็ผัสสะเป็นไฉน`,
        `ผัสสะ 6 หมวดเหล่านี้คือ`,
        `จักขุสัมผัส`,
        `โสตะสัมผัส`,
        `ฆานสัมผัส`,
        `ชิวหาสัมผัส`,
        `กายสัมผัส`,
        `มโนสัมผัส`,
        `นี้เรียกว่าผัสสะ`,

        `ก็สฬายตนะเป็นไฉน`,
        `สฬายตนะคือ`,
        `ตา หู จมูก`,
        `ลิ้น กาย ใจ`,
        `นี้เรียกว่าสฬายตนะ`,

        `ก็นามรูปเป็นไฉน`,
        `เวทนา สัญญา เจตนา`,
        `ผัสสะ มนสิการ`,
        `นี้เรียกว่านาม`,
        `มหาภูตรูป 4`,
        `และรูปที่อาศัยมหาภูตรูป 4`,
        `นี้เรียกว่ารูป`,
        `นามและรูปดังพรรณนามาฉะนี้`,
        `เรียกว่านามรูป`,

        `ก็วิญญาณเป็นไฉน`,
        `วิญญาณ 6 หมวดเหล่านี้คือ`,
        `จักขุวิญญาณ`,
        `โสตะวิญญาณ`,
        `ฆานวิญญาณ`,
        `ชิวหาวิญญาณ`,
        `กายวิญญาณ`,
        `มโนวิญญาณ`,
        `นี้เรียกว่าวิญญาณ`,

        `ก็สังขารเป็นไฉน`,
        `สังขาร 3 เหล่านี้คือ`,
        `กายสังขาร`,
        `วจีสังขาร`,
        `จิตสังขาร`,
        `นี้เรียกว่าสังขาร`,

        `ก็อวิชชาเป็นไฉน`,
        `ความไม่รู้ในทุกข์`,
        `ความไม่รู้ในเหตุเกิดแห่งทุกข์`,
        `ความไม่รู้ในความดับทุกข์`,
        `ความไม่รู้ในปฏิปทา`,
        `ที่จะให้ถึงความดับทุกข์`,
        `นี้เรียกว่าอวิชา`,

        `ดูกรภิกษุทั้งหลาย`,
        `เพราะอวิชชาเป็นปัจจัยจึงมีสังขาร`,
        `เพราะสังขารเป็นปัจจัยจึงมีวิญญาณ`,
        `ดังพรรณนามาฉะนี้`,
        `ความเกิดขึ้นแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้`,

        `ก็เพราะอวิชชานั่นแหละ`,
        `ดับด้วยการสำรอกโดยไม่เหลือ`,
        `สังขารจึงดับ`,
        `เพราะสังขารดับวิญญาณจึงดับ`,
        `ความดับแห่งกองทุกข์ทั้งมวลนี้`,
        `ย่อมมีด้วยประการอย่างนี้`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">วิภังคสูตร</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0508" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0507

export const Head = () => (
  <SEO title="Lesson0507" />
)