import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0315 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `สมัยหนึ่งพระผู้มีพระภาค`,
        `ประทับอยู่ ณ กูฎาคารศาลา`,
        `ในป่ามหาวันใกล้พระนครเวสาลี`,
        `ครั้งนั้นแล`,
        `อุคค คฤหบดีชาวเมืองเวสาลี`,
        `ได้เข้าไปเฝ้าพระผู้มีพระภาค`,
        `ถึงที่ประทับ`,
        `ครั้นแล้วได้ทูลถามพระผู้มีพระภาค`,
        `ว่าข้าแต่พระองค์ผู้เจริญ`,
        `เหตุปัจจัยอะไรหนอแล`,
        `เป็นเครื่องให้สัตว์บางพวก`,
        `ในโลกนี้ไม่ปรินิพพานในปัจจุบัน`,
        `อนึ่ง เหตุปัจจัยอะไร`,
        `เป็นเครื่องให้สัตว์บางพวก`,
        `ในโลกนี้ปรินิพพานในปัจจุบัน`,

        `พระผู้มีพระภาคตรัสว่า`,
        `มีอยู่แลคฤหบดี`,
        `รูปทั้งหลายอันบุคคลพึงรู้แจ้ง`,
        `ด้วยจักษุอันน่าปรารถนาน่าใคร่น่าพอใจ`,
        `น่ารัก ชักให้ใคร่`,
        `ชวนให้กำหนัด `,
        `หากว่าภิกษุเพลิน`,
        `หมกมุ่น พัวพันรูปนั้น`,
        `เมื่อภิกษุนั้นเพลิน`,
        `หมกมุ่น พัวพันรูปนั้นอยู่`,
        `วิญญาณอันอาศัยซึ่งตัณหานั้นก็ย่อมมี`,
        `อุปาทานอันอาศัยซึ่งตัณหานั้นก็ย่อมมี`,
        `ภิกษุผู้มีอุปาทานย่อมไม่ปรินิพพาน`,
        `เสียง กลิ่น รส`,
        `โผฏฐัพพะ และธรรมารมณ์`,
        `อันบุคคลพึงรู้แจ้งด้วยใจ`,
        `อันน่าปรารถนาน่าใคร่ น่าพอใจ`,
        `น่ารักชักให้ใคร่`,
        `ชวนให้กำหนัด`,
        `หากว่าภิกษุ เพลิดเพลิน`,
        `หมกมุ่นพัวพันธรรมารมณ์นั้น`,
        `เมื่อภิกษุนั้นเพลิดเพลิน`,
        `หมกมุ่น พัวพันธรรมารมณ์นั้นอยู่`,
        `วิญญาณอันอาศัยซึ่งตัณหานั้นก็ย่อมมี`,
        `อุปาทานอาศัยซึ่งปัญหานั้นก็ย่อมมี`,
        `ภิกษุผู้มีอุปาทานย่อมไม่ปรินิพพาน`,
        `ดูกรคฤหบดีเหตุปัจจัยนี้แล`,
        `เป็นเครื่องให้สัตว์บางพวก`,
        `ในโลกนี้ไม่ปรินิพพานในปัจจุบัน`,

        `ดูกรและคฤหบดี`,
        `รูปอันบุคคลพึงรู้แจ้งด้วยจักษุ`,
        `อันน่าปรารถนาน่าใคร่น่าพอใจ`,
        `น่ารัก ชักให้ใคร่`,
        `ชวนให้กำหนัด`,
        `หากว่าภิกษุไม่เพลิดเพลิน`,
        `ไม่หมกมุ่นไม่พัวพันรูปนั้น`,
        `เมื่อภิกษุนั้นไม่เพลิดเพลิน`,
        `ไม่หมกมุ่นไม่พัวพันรูปนั้นอยู่`,
        `วิญญาณอาศัยซึ่งตัณหานั้นก็ย่อมไม่มี`,
        `อุปาทานอันอาศัยซึ่งตัณหา`,
        `นั้นก็ย่อมไม่มี`,
        `ภิกษุผู้ไม่มีอุปทานย่อมปรินิพพาน`,
        `เสียง กลิ่น รส`,
        `โผฏฐัพพะ และธรรมารมณ์ `,
        `อันบุคคลพึงรู้แจ้งด้วยใจ`,
        `อันน่าปรารถนาน่าใคร่ น่าพอใจ`,
        `น่ารัก ชักให้ใคร่ ชวนให้กำหนัด`,
        `หากภิกษุไม่เพลิดเพลิน`,
        `ไม่หมกมุ่น ไม่พัวพันธรรมารมณ์นั้น`,
        `เมื่อภิกษุนั้นไม่เพลินไม่หมกมุ่น`,
        `ไม่พัวพันในธรรมารมณ์นั้นอยู่`,
        `วิญญาณอันอาศัยซึ่งตัณหานั้นก็ย่อมไม่มี`,
        `อุปาทานอันอาศัยซึ่งตัณหานั้นก็ย่อมไม่มี`,
        `ภิกษุผู้ไม่มีอุปาทานย่อมปรินิพพาน`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ว่าด้วยเหตุปัจจัยเป็นเครื่องให้สัตว์ไม่ปรินิพพานและปรินิพพาน</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0315