import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0313 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `พระพุทธเจ้าตรัสไว้ว่าย่อมเป็นผู้มีสติอย่างไร`,
        `ย่อมเป็นผู้มีปกติเห็นกายในกายอยู่`,
        `มีความเพียรมีสัมปชัญญะมีสติ`,
        `กำจัดอภิชฌาและโทมนัสในโลกเสีย`,
        `ย่อมเป็นผู้มีปกติเห็นเวทนาในเวทนาอยู่`,
        `มีความเพียรมีสัมปชัญญะมีสติ`,
        `กำจัดอภิชฌาและโทมนัสในโลกเสีย`,
        `ย่อมเป็นผู้มีปกติเห็นจิตในจิตอยู่`,
        `มีความเพียรมีสัมปชัญญะมีสติ`,
        `กำจัดอภิชฌาและโทมนัสในโลกเสีย`,
        `ย่อมเป็นผู้มีปกติเห็นธรรมในธรรม`,
        `มีความเพียรมีสัมปชัญญะมีสติ`,
        `กำจัดอภิชฌาและโทมนัสในโลกเสีย`,
        `ย่อมเป็นผู้มีสติอย่างนี้แล`,

        `ย่อมเป็นผู้มีสัมปชัญญะอย่างไร`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวในก้าวไปในการถอยกลับ`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวในการแลในการเหลียว`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวในการคู้เข้าเหยียดออก`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวทรงผ้าสังฆาฏิบาตรและจีวร`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวในการกิน ดื่ม เคี้ยว ลิ้ม`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวในการถ่ายอุจจาระปัสสาวะ`,
        `ย่อมเป็นผู้มีปกติทำความรู้สึกตัวในการเดินในการยืน นั่ง หลับ ตื่น พูด นิ่ง`,
        `ย่อมเป็นผู้มีสติสัมปชัญญะอย่างนี้แล`,

        `ถ้าเมื่อนั้นมีสติสัมปชัญญะเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยวอยู่อย่างนี้`,
        `สุขเวทนาย่อมบังเกิดขึ้น`,
        `เธอย่อมรู้ชัดอย่างนี้ว่าสุขเวทนานี้บังเกิดขึ้นแล้วแก่เราแล`,
        `ก็แต่ว่าสุขเวทนานั้นอาศัยจึงเกิดขึ้น`,
        `ไม่อาศัยไม่เกิดขึ้น`,
        `อาศัยอะไรอาศัยกายนี้เอง`,
        `ก็กายนี้แลไม่เที่ยงอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `ก็สุขเวทนาอันอาศัยกายอันไม่เที่ยง`,
        `ปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `แล้วจึงบังเกิดขึ้นจะเที่ยงแต่ที่ไหน`,
        `ดังนี้เธอย่อมพิจารณาเห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป`,
        `ความดับความสละคืนในกายและในสุขเวทนาอยู่`,
        `เมื่อเธอพิจารณาเห็นความไม่เที่ยงความเสื่อมไปความคลายไป`,
        `ความดับความสละคืนในกายและในสุขเวทนาอยู่`,
        `ย่อมละราคานุสัยในกายและในสุขเวทนาเสียได้`,

        `ถ้าเมื่อนั้นมีสติสัมปชัญญะเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยวอยู่อย่างนี้`,
        `ทุกขเวทนาย่อมบังเกิดขึ้น`,
        `เธอย่อมรู้ชัดอย่างนี้ว่า ทุกขเวทนานี้บังเกิดขึ้นแล้วแก่เราแล`,
        `ก็แต่ว่าทุกขเวทนานั้นอาศัยจึงเกิดขึ้น`,
        `ไม่อาศัยไม่เกิดขึ้น`,
        `อาศัยอะไรอาศัยกายนี้เอง`,
        `ก็กายนี้แลไม่เที่ยงอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `ก็ทุกขเวทนาอันอาศัยกายอันไม่เที่ยง`,
        `ปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `แล้วจึงบังเกิดขึ้นจะเที่ยงแต่ที่ไหน`,
        `ดังนี้เธอย่อมพิจารณาเห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป`,
        `ความดับความสละคืนในกายและในทุกขเวทนาอยู่`,
        `เมื่อเธอพิจารณาเห็นความไม่เที่ยงความเสื่อมไปความคลายไป`,
        `ความดับความสละคืนในกายและในทุกขเวทนาอยู่`,
        `ย่อมละปฏิฆานุสัยในกายและในทุกขเวทนาเสียได้`,

        `ถ้าเมื่อนั้นมีสติสัมปชัญญะเป็นผู้ไม่ประมาท`,
        `มีความเพียรมีใจเด็ดเดี่ยวอยู่อย่างนี้`,
        `ไม่ทุกข์ไม่สุขเวทนา ย่อมบังเกิดขึ้น`,
        `เธอย่อมรู้ชัดอย่างนี้ว่าไม่ทุกข์ไม่สุขเวทนานี้บังเกิดขึ้นแล้วแก่เราแล`,
        `ก็แต่ว่าไม่ทุกข์ไม่สุขเวทนานั้นอาศัยจึงเกิดขึ้น`,
        `ไม่อาศัยไม่เกิดขึ้น`,
        `อาศัยอะไรอาศัยกายนี้เอง`,
        `ก็กลายนี้แหละไม่เที่ยงอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `อาศัยอะไรอาศัยกายนี้เอง`,
        `ก็กายนี้แลไม่เที่ยงอันปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `ก็ไม่ทุกข์ไม่สุขเวทนาอาศัยกายอันไม่เที่ยง`,
        `ปัจจัยปรุงแต่งอาศัยกันเกิดขึ้น`,
        `แล้วจึงบังเกิดขึ้นจักเที่ยงแต่ที่ไหน`,
        `ดังนี้เธอย่อมพิจารณาเห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป`,
        `ความดับความสละคืนในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่`,
        `เมื่อเธอพิจารณาเห็นความไม่เที่ยง ความเสื่อมไป ความคลายไป`,
        `ความดับความสละคืนในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่`,
        `ความดับ ความสละคืนในกายและในไม่ทุกข์ไม่สุขเวทนาอยู่`,
        `ย่อมละอวิชชานุสัยในกายและในไม่ทุกข์ไม่สุขเวทนาเสียได้`,

        `ถ้าเมื่อนั้นเสวยสุขเวทนาก็รู้ชัดว่า`,
        `สุขเวทนาไม่เที่ยงไม่น่าหมกมุ่น ไม่น่าเพลิดเพลิน`,
        `ถ้าเสวยทุกขเวทนาก็รู้ชัดว่า`,
        `ทุกขเวทนาไม่เที่ยงไม่น่าหมกมุ่นไม่น่าเพลิดเพลิน`,
        `ถ้าเสวยไม่ทุกข์ไม่สุขเวทนาก็รู้ชัดว่า`,
        `ไม่ทุกข์ไม่สุขเวทนาไม่เที่ยงไม่น่าหมกมุ่น ไม่น่าเพลิดเพลิน`,

        `ถ้าเธอเสวยสุขเวทนาย่อมเป็นผู้ปราศจากกิเลสเสวยสุขเวทนานั้น`,
        `ถ้าเธอเสวยทุกขเวทนาย่อมเป็นผู้ปราศจากกิเลสเสวยทุกขเวทนานั้น`,
        `ถ้าเธอเสวยไม่ทุกข์ไม่สุขเวทนา`,
        `ย่อมเป็นผู้ปราศจากกิเลสเสวยไม่ทุกข์ไม่สุขเวทนานั้น`,
        `เมื่อเสวยเวทนามีกายเป็นที่สุด`,
        `ก็รู้ชัดว่าเราเสวยเวทนามีกายเป็นที่สุด`,
        `เมื่อเสวยเวทนามีชีวิตเป็นที่สุด`,
        `ก็รู้ชัดว่าเราเสวยเวทนามีชีวิตเป็นที่สุด`,
        `ย่อมรู้ชัดว่าเมื่อตายไป`,
        `เวทนาทั้งปวงอันไม่น่าเพลิดเพลินจักเป็นความเย็นในโลกนี้ทีเดียว`,

        `เปรียบเหมือนประทีปน้ำมัน`,
        `อาศัยน้ำมันและไส้จึงลูกโพลงอยู่ได้`,
        `เพราะสิ้นน้ำมันและไส้ประทีปนั้น`,
        `ไม่มีเชื้อพึงดับไปฉันใดก็ฉันนั้นเหมือนกัน`,
        `เมื่อเสวยเวทนามีกายเป็นที่สุด`,
        `ย่อมรู้ชัดว่าเราเสวยเวทนามีกายเป็นที่สุด`,
        `เมื่อเสวยเวทนามีชีวิตเป็นที่สุด`,
        `ย่อมรู้ชัดว่าเราเสวยเวทนามีชีวิตเป็นที่สุด`,
        `ย่อมรู้ชัดว่าเมื่อตายไป`,
        `เวทนาทั้งปวงอันไม่น่าเพลิดเพลินจักเป็นความเย็นในโลกนี้ทีเดียว`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ว่าด้วยควรเป็นผู้มีสติสัมปชัญญะ</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a className="space" href="/lesson0314" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0313