import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0202 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
          `ตาเห็นรูป รูปไม่เที่ยงเกิดดับ จักขุไม่เที่ยงเกิดดับ รูปไม่เที่ยงเกิดดับ`,
          `จักขุวิญญาณไม่เที่ยงเกิดดับ จักขุสัมผัสไม่เที่ยงเกิดดับ`,
          `กำหนดรู้องค์ประกอบของตาเห็นรูป`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากจักขุสัมผัสเป็นปัจจัยคือผลต่อเนื่องของ`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น`,
          `เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กำหนดรู้ผลต่อเนื่องของตาเห็นรูป`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,

          `หูได้ยินเสียง เสียงไม่เที่ยงเกิดดับ โสตะไม่เที่ยงเกิดดับ เสียงไม่เที่ยงเกิดดับ`,
          `โสตะวิญญาณไม่เที่ยงเกิดดับ โสตะสัมผัสไม่เที่ยงเกิดดับ`,
          `กำหนดรู้องค์ประกอบของหูได้ยินเสียง`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากโสตะสัมผัสเป็นปัจจัยคือผลต่อเนื่องของ`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น`,
          `เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กำหนดรู้ผลต่อเนื่องของหูได้ยินเสียง`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,

          `จมูกได้กลิ่น กลิ่นไม่เที่ยงเกิดดับ ฆานะไม่เที่ยงเกิดดับ กลิ่นไม่เที่ยงเกิดดับ`,
          `ฆานะวิญญาณไม่เที่ยงเกิดดับ ฆานะสัมผัสไม่เที่ยงเกิดดับ`,
          `กำหนดรู้องค์ประกอบของจมูกได้กลิ่น`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากฆานะสัมผัสเป็นปัจจัยคือผลต่อเนื่องของ`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น`,
          `เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กำหนดรู้ผลต่อเนื่องของจมูกได้กลิ่น`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,

          `ลิ้นได้รส รสไม่เที่ยงเกิดดับ ชิวหาไม่เที่ยงเกิดดับ รสไม่เที่ยงเกิดดับ`,
          `ชิวหาวิญญาณไม่เที่ยงเกิดดับ ชิวหาสัมผัสไม่เที่ยงเกิดดับ`,
          `กำหนดรู้องค์ประกอบของลิ้นได้รส`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากชิวหาสัมผัสเป็นปัจจัยคือผลต่อเนื่องของ`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น`,
          `เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กำหนดรู้ผลต่อเนื่องของลิ้นได้รส`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,

          `กายสัมผัส สัมผัสไม่เที่ยงเกิดดับ กายไม่เที่ยงเกิดดับ สัมผัสไม่เที่ยงเกิดดับ`,
          `กายวิญญาณไม่เที่ยงเกิดดับ กายสัมผัสไม่เที่ยงเกิดดับ`,
          `กำหนดรู้องค์ประกอบของกายสัมผัส`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากกายสัมผัสเป็นปัจจัยคือผลต่อเนื่องของ`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น`,
          `เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กำหนดรู้ผลต่อเนื่องของกายสัมผัส`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,

          `ใจคิดนึก ความคิดไม่เที่ยงเกิดดับ มโนไม่เที่ยงเกิดดับ ธรรมารมณ์ไม่เที่ยงเกิดดับ`,
          `มโนวิญญาณไม่เที่ยงเกิดดับ มโนสัมผัสไม่เที่ยงเกิดดับ`,
          `กำหนดรู้องค์ประกอบของใจคิดนึก`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `ทุกข์สุข ไม่ทุกข์ไม่สุข ที่เกิดจากมโนสัมผัสเป็นปัจจัยคือผลต่อเนื่องของ`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
          `เกิดจากเหตุปัจจัยมาประชุมปรุงแต่งชั่วคราว แล้วแตกสลาย`,
          `ไม่มีตัวตนเป็นของตนเอง ไม่ควรไปยึดมั่นถือมั่นว่าสิ่งนั้น`,
          `เป็นของเรา เป็นเรา เป็นตัวตนของเรา ไม่เที่ยงเกิดดับ`,
          `กำหนดรู้ผลต่อเนื่องของใจคิดนึก`,
          `โลกและชีวิตเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,

          `ทุกสิ่งทุกอย่างที่มากระทบสัมผัส`,
          `มีองค์ประกอบและผลต่อเนื่องเหมือนกัน`,
          `มันเป็นธรรมชาติชนิดหนึ่ง ไม่เที่ยงเกิดดับ`,
        ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">      
              <h1><div className="text">การพิจารณาอินทรีย์ 6</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="listparagraph">
            <a href="/praise" >
              <span className="highlight" style={{fontSize: "2.5em"}}>
                หน้าแรก
              </span>
            </a>
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a href="/lesson0203" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0202