import React, { useEffect, useRef } from 'react'
import { navigate } from 'gatsby'
import Typed from 'typed.js'
import bgvdo from '../videos/mountain02.mp4'
import '../scss/main.scss'


// markup
const Lesson0308 = () => {

  const el = useRef(null)
  const typed = useRef(null)
  useEffect(() => {
    const options = {
      strings: [
        `1. พระพุทธเจ้าทรงตรัสถามพระอานนท์ว่า`,
        `จักษุเที่ยงหรือไม่เที่ยง`,
        `พระอานนท์ตอบว่า`,
        `ไม่เที่ยงพระเจ้าข้า`,
        `2. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า`,
        `พระอานนท์ตอบว่า`,
        `เป็นทุกข์พระเจ้าข้า`,
        `3. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `เป็นทุกข์`,
        `มีความแปรปรวนเป็นธรรมดา`,
        `ควรหรือหนอที่จะตามเห็นสิ่งนั้นว่านั่นเป็นของเรา`,
        `เป็นเรา`,
        `เป็นตัวตนของเรา`,
        `พระอานนท์ตอบว่า`,
        `ไม่ควรเห็นอย่างนั้นพระเจ้าข้า`,
        `4. พระพุทธเจ้าทรงตรัสถามพระอานนท์ว่า`,
        `รูปเที่ยงหรือไม่เที่ยง`,
        `พระอานนท์ตอบว่า`,
        `ไม่เที่ยงพระเจ้าข้า`,
        `5. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า`,
        `พระอานนท์ตอบว่า`,
        `เป็นทุกข์พระเจ้าข้า`,
        `6. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `เป็นทุกข์`,
        `มีความแปรปรวนเป็นธรรมดา`,
        `ควรหรือหนอที่จะตามเห็นสิ่งนั้นว่านั่นเป็นของเรา`,
        `เป็นเรา`,
        `เป็นตัวตนของเรา`,
        `พระอานนท์ตอบว่า`,
        `ไม่ควรเห็นอย่างนั้นพระเจ้าข้า`,
        `7. พระพุทธเจ้าทรงตรัสถามพระอานนท์ว่า`,
        `จักษุวิญญาณ`,
        `จักษุสัมผัส`,
        `สุขเวทนา`,
        `ทุกขเวทนา`,
        `หรือไม่ทุกข์ไม่สุขเวทนา`,
        `ที่เกิดขึ้นเพราะจักษุสัมผัสเป็นปัจจัยเที่ยงหรือไม่เที่ยง`,
        `พระอานนท์ตอบว่า`,
        `ไม่เที่ยงพระเจ้าข้า`,
        `8. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า`,
        `พระอานนท์ตอบว่า`,
        `เป็นทุกข์พระเจ้าข้า`,
        `9. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `เป็นทุกข์`,
        `มีความแปรปรวนเป็นธรรมดา`,
        `ควรหรือหนอที่จะตามเห็นสิ่งนั้นว่านั่นเป็นของเรา`,
        `เป็นเรา`,
        `เป็นตัวตนของเรา`,
        `พระอานนท์ตอบว่า`,
        `ไม่ควรเห็นอย่างนั้นพระเจ้าข้า`,
        `10. พระพุทธเจ้าทรงตรัสถามพระอานนท์ว่า`,
        `ใจเที่ยงหรือไม่เที่ยง`,
        `พระอานนท์ตอบว่า`,
        `ไม่เที่ยงพระเจ้าข้า`,
        `11. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า`,
        `พระอานนท์ตอบว่า`,
        `เป็นทุกข์พระเจ้าข้า`,
        `12. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `เป็นทุกข์`,
        `มีความแปรปรวนเป็นธรรมดา`,
        `ควรหรือหนอที่จะตามเห็นสิ่งนั้นว่านั่นเป็นของเรา`,
        `เป็นเรา`,
        `เป็นตัวตนของเรา`,
        `พระอานนท์ตอบว่า`,
        `ไม่ควรเห็นอย่างนั้นพระเจ้าข้า`,
        `13. พระพุทธเจ้าทรงตรัสถามพระอานนท์ว่า`,
        `ธรรมารมณ์เที่ยงหรือไม่เที่ยง`,
        `พระอานนท์ตอบว่า`,
        `ไม่เที่ยงพระเจ้าข้า`,
        `14. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า`,
        `พระอานนท์ตอบว่า`,
        `เป็นทุกข์พระเจ้าข้า`,
        `15. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `เป็นทุกข์`,
        `มีความแปรปรวนเป็นธรรมดา`,
        `ควรหรือหนอที่จะตามเห็นสิ่งนั้นว่านั่นเป็นของเรา`,
        `เป็นเรา`,
        `เป็นตัวตนของเรา`,
        `พระอานนท์ตอบว่า`,
        `ไม่ควรเห็นอย่างนั้นพระเจ้าข้า`,
        `16. พระพุทธเจ้าทรงตรัสถามพระอานนท์ว่า`,
        `มโนวิญญาณ`,
        `มโนสัมผัส`,
        `สุขเวทนา`,
        `ทุกขเวทนา`,
        `หรือไม่ทุกข์ไม่สุขเวทนา`,
        `ที่เกิดขึ้นเพราะมโนสัมผัสเป็นปัจจัยเที่ยงหรือไม่เที่ยง`,
        `พระอานนท์ตอบว่า`,
        `ไม่เที่ยงพระเจ้าข้า`,
        `17. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `สิ่งนั้นเป็นทุกข์หรือเป็นสุขเล่า`,
        `พระอานนท์ตอบว่า`,
        `เป็นทุกข์พระเจ้าข้า`,
        `18. พระพุทธเจ้าทรงตรัสถามพระอานนท์ต่อไปว่า`,
        `ก็สิ่งใดไม่เที่ยง`,
        `เป็นทุกข์`,
        `มีความแปรปรวนเป็นธรรมดา`,
        `ควรหรือหนอที่จะตามเห็นสิ่งนั้นว่านั่นเป็นของเรา`,
        `เป็นเรา`,
        `เป็นตัวตนของเรา`,
        `พระอานนท์ตอบว่า`,
        `ไม่ควรเห็นอย่างนั้นพระเจ้าข้า`,

        `อริยสาวกผู้ได้สดับแล้วเห็นอยู่อย่างนี้`,
        `ย่อมเบื่อหน่อยทั้งในจักษุ`,
        `ทั้งในรูป`,
        `ทั้งในจักษุวิญญาณ`,
        `ทั้งในจักษุสัมผัส`,
        `ทั้งในสุขเวทนาทุกขเวทนา`,
        `หรือไม่ทุกข์ไม่สุขเวทนา`,
        `ที่เกิดขึ้นเพราะอาศัยจักษุสัมผัสเป็นปัจจัยตามความเป้นจริง`,
        `เมื่อเบื่อหน่อยย่อมคลายกำหนัด`,
        `เพราะคลายกำหนัดจึงหลุดพ้น`,
        `เมื่อหลุดพ้นแล้วย่อมมีญาณหยั่งรู้ว่าหลุดพ้นแล้ว`,
        `รู้ชัดว่าชาติสิ้นแล้ว`,
        `พรหมจรรย์อยู่จบแล้ว`,
        `กิจที่ควรทำ ทำเสร็จแล้ว`,
        `กิจอื่นเพื่อความเป็นอย่างนี้มิได้มีอีก`,
      ],
      typeSpeed: 45,
      fadeOut: true,
      fadeOutDelay: 0,
      loop: true,
    };
    typed.current = new Typed(el.current, options)

    return () => {
      typed.current.destroy()
    }
  }, [])
  return (
    <>
      <div className="overflow-wrap">
      <section id="home" className="flex section--dark">
          <div className="bg-video">
          <video className="bg-video__content" autoPlay={true} loop muted playsInline>
                  <source src={bgvdo} type="video/mp4" />
              </video>
          </div>
          <div className="flex">
              <a href="/praise" >
                <span className="highlight" style={{fontSize: "2.5em"}}>
                  หน้าแรก
                </span>
              </a>
              <h1><div className="text">ว่าด้วยทรงแสดงธรรมเพื่อความเป็นผู้อยู่ผู้เดียว</div></h1>
              
              <h1>
                <div className="text">
                  <span style={{ whiteSpace: 'pre' }} ref={el} />
                </div>
              </h1>        
          </div>
          <div className="next">
            <a className="space" style={{cursor:'pointer'}} onClick={() => navigate(-1)}>
              <i className="fa-solid fa-angle-left fa-5x"></i>
            </a>
            
            <a href="/lesson0309" >
              <i className="fa-solid fa-angle-right fa-5x"></i>
            </a>
          </div>
      </section>
      </div>
    </>
  )
}

export default Lesson0308